[{"id":2422,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2422-inimigo-meu-o-eterno-conflito-entre-gestores-de-produtos-e-gestores-comerciais","title":"Inimigo Meu: o eterno conflito entre gestores de produtos e gestores comerciais","authors":[{"user_id":3220,"user_uri":"https://submissoes.agilebrazil.com/users/3220-affaggion","username":"affaggion","name":"André Faggion","gravatar_url":"https://gravatar.com/avatar/5163f4191d8ee560a4c9fabcccc0a099.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Não há","tags":["Análise de negócio","Negócios","Gestão de Mudanças","Cultura","Gestão","Mindset","Pessoas","Planejamento","Princípios e valores","Produto","Papéis e Responsabilidades","Estratégia"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"Como gestores de produto, quantas vezes nos deparamos em conflito entre priorizar features importantes para a evolução do produto e features necessárias para fechamentos de negócios? Nesse papo, abordarei esse assunto com o viés de apresentar algumas das principais habilidades (estratégia, visão sistêmica, negociação, comunicação e empatia) que um product manager precisa ter e utilizar para contornar esse conflitos e minimizar a angústia dos envolvidos.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-05T13:26:40-03:00"},{"id":2432,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2432-introducao-a-comunicacao-nao-violenta-aplicada-em-times-ageis","title":"Introdução a Comunicação Não Violenta aplicada em times Ágeis","authors":[{"user_id":3232,"user_uri":"https://submissoes.agilebrazil.com/users/3232-blasimaira","username":"blasimaira","name":"Maíra Blasi","gravatar_url":"https://gravatar.com/avatar/05f0a2e8ff71ce094c20d87cb290a0a4.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Não existe pré-requisito","tags":["Coaching","Cultura","Facilitação","Feedback","Gestão","Mindset","Pessoas","Times"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":25,"summary":"Colaboração e Confiança são duas palavras super difundidas dentro do contexto da Agilidade, porém o \"como\" conseguir gerá-las dentro do time, nem tanto. A CNV, apoiada na escuta empática, oferece estratégias de comunicação que ajudam a compreender a perspectiva do outro, nos apresentando um repertório mais amplo para lidar com conflitos do cotidiano.\r\n\r\nNesse workshop veremos que confiança e colaboração são sustentadas por uma comunicação transparente e empática. Para entender melhor o tema, passaremos juntos pelas 4 fases de uma conversa: Observação, sentimento, necessidade e pedido, através de dinâmicas de fixação onde experimentaremos o aprendizado aplicado em casos reais.","mechanics":"Durante o workshop passaremos pelas 4 fases de uma conversa, de acordo com a proposta de Marshall Rosenberg:\r\n\r\n\r\nPrimeiro falaremos dos conceitos de certo e errado e de punição e premiação e como isso interfere na forma que a gente estabelece a nossa comunicação.\r\n\r\n\r\nEm seguida entraremos em cada uma das etapas, sendo solicitado que cada um dos participantes escolha um caso real para ir aplicando o aprendizado durante o processo:\r\n\r\n\r\nObservação - Mostrarei como carregamos nossas observações com julgamentos e generalizações que acusam o outro e acabam por se tornar uma forma de violência.\r\n\r\nSentimentos - Através de uma dinâmica mostrarei como separar sentimentos verdadeiros de pseudo sentimentos, para evitar mais uma vez acusar o outro ao invés de esclarecer como você realmente se sentiu em relação ao fato. Nesse momento cada participante ganhará uma lista de apoio com muitos sentimentos, para que tenham uma \"cola\" caso faltem palavras\r\n\r\nNecessidades - Aqui esclareceremos que atrás de cada sentimento, existe uma necessidade não atendida e que precisamos dessa compreensão para melhorar nossa assertividade na comunicação. Nesse ponto cada participante também ganhará uma folha com uma lista de necessidades e valores consideradas universais.\r\n\r\n\r\nPedidos - Muitas vezes nós não sabemos fazer pedidos e esperamos que as pessoas adivinhem o que a gente deseja, nesse ponto aprenderemos a construir pedidos em uma linguagem positiva, que nos aproximará mais de alcançar o que desejamos.\r\n\r\n\r\nPor fim o fechamento, explicando que o mesmo formato que é utilizado para fala, pode servir para melhorar nossa escuta.","status":"Aceita","author_agreement":true,"image_agreement":false,"created_at":"2019-04-08T19:22:45-03:00"},{"id":2433,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2433-respeito-em-foco-aplicando-o-design-thinking-por-uma-sociedade-mais-inclusiva-quanto-a-diversidade","title":"Respeito em Foco - Aplicando o Design Thinking por uma sociedade mais inclusiva quanto a Diversidade","authors":[{"user_id":3022,"user_uri":"https://submissoes.agilebrazil.com/users/3022-samuel-thome","username":"samuel.thome","name":"Samuel Thome","gravatar_url":"https://gravatar.com/avatar/39dddcc9437b712875466e49666cda31.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhececimento superficial sobre Design Thinking","tags":["Coaching","Cultura","Design","Aprendizagem","Pessoas","UX","Visualização"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":32,"summary":"A base do Design Thinking é a Empatia, sendo assim ele pode ser aplicado em diversos tipos de situações. Por isso, por que não utilizar para combater o bullying e preconceito em todos os ambientes? É isso que o Respeito em Foco faz. Conheça e participe, com a mão na massa, essa iniciativa que já impactou positivamente mais de 1000 pessoas nos últimos 3 anos, desde crianças e adolescentes a adultos em ambientes como escolas, ONGs, faculdades e no meio corporativo. Nele nós abordamos situações de temas de diversidade como: Gênero, LGBT+, Etnia e PcD, com o objetivo de conscientizar a todos sobre a importância do respeito quanto a Diversidade em todas as suas formas e em todos os lugares, através de uma dinâmica leve e descontraída, aplicando algumas técnicas do Design Thinking.","mechanics":"Será feita uma introdução do programa, uma dinâmica em grupo para quebrar o gelo, e em seguida iremos começar a mão na massa, onde será apresentado situações reais de preconceito/bullying dentro do ambiente de trabalho referente a 4 temas: Gênero, LGBT+, Etnia e PcD. Os participantes serão divididos em 4 grupos representando cada um desses grupos, e então eles irão criar uma Persona (personagem) dentro da situação que irão receber, para gerar um ambiente lúdico e ao mesmo tempo empático. Após a Persona criada, iremos utilizar a técnica do ‘Mapa da Empatia’ que o Design Thinking traz, onde será proposto para que os participantes se coloquem no lugar da pessoa que sofreu aquela situação, elaborando: \"O que você: Faria, Sentiria, Pensaria e Falaria se fosse com você\". Depois o grupo faz a leitura dos principais pontos e então é apresentado um video ou texto dos personagens reais que sofreram aquelas situações e o que eles realmente sentiram, para validar se o que o grupo colocou, realmente fez sentido. Por fim, encerramos com uma 'Ideação' para que situações semelhantes não aconteçam novamente ou possam ser amenizadas.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-09T00:07:25-03:00"},{"id":2452,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2452-projetos-ageis-com-clientes-remotos-desafios-da-analise-de-negocios","title":"Projetos ágeis com clientes remotos: desafios da Análise de Negócios","authors":[{"user_id":3241,"user_uri":"https://submissoes.agilebrazil.com/users/3241-priaraujo","username":"priaraujo","name":"Priscila Araujo","gravatar_url":"https://gravatar.com/avatar/ef7b54d85de5624b6bf8fa919493d4c5.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":1917,"user_uri":"https://submissoes.agilebrazil.com/users/1917-marcely","username":"marcely","name":"Marcely Santos","gravatar_url":"https://gravatar.com/avatar/a57c9633f522a7e4e133e97def6ac43f.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Não é necessário conhecimento prévio para assistir a esta palestra.","tags":["Análise de negócio","Negócios","Cultura","Facilitação","Feedback","Kanban","Lean","Métricas","Pessoas","Planejamento","Práticas","Processo","Produto","Projeto","Requisitos","Papéis e Responsabilidades","Scrum","Estratégia","Times"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"O mercado de TI está cada vez mais aquecido e projetos com clientes de outros estados e até mesmo de outros países têm se tornado uma realidade. Esta palestra visa compartilhar experiências de uma Analista de Negócios que atua em projeto ágil com cliente localizado em outro país, sendo o time de desenvolvimento do projeto formado por profissionais que estão dentro e fora do Brasil. Desafios são vistos no dia a dia do projeto, tanto em relação à disparidade de fuso horário como diferenças culturais, mas existem formas de transformá-los em grandes oportunidades para unir os times e fazer do projeto um sucesso. Nesta palestra, serão compartilhados desafios vivenciados e como superá-los.","mechanics":"A apresentação será feita com apresentação de slides, onde Priscila e Marcely irão compartilhar experiências vividas em projetos que foram desafiadores para o papel do analista de negócios no cenário ágil.","status":"Aguardando confirmação","author_agreement":null,"image_agreement":null,"created_at":"2019-04-11T12:41:18-03:00"},{"id":2455,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2455-metricas-em-times-ageis-o-essencial-que-voce-precisa-saber-mas-nao-te-contaram","title":"Métricas em times ágeis: O essencial que você precisa saber, mas não te contaram!","authors":[{"user_id":2721,"user_uri":"https://submissoes.agilebrazil.com/users/2721-cleitonmafra","username":"cleitonmafra","name":"Caco - Cleiton Mafra","gravatar_url":"https://gravatar.com/avatar/8c910c1dc16f7c5cc29292a4d980a94b.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":2376,"user_uri":"https://submissoes.agilebrazil.com/users/2376-raphalbino","username":"raphalbino","name":"Raphael Albino","gravatar_url":"https://gravatar.com/avatar/7d186f4d66d37be53021a15abad12449.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Ter um conhecimento mínimo sobre equipes ágeis e aplicação de Scrum ou Método Kanban","tags":["Gestão de Mudanças","Coaching","Data","Estimativa","Kanban","Gestão","Maturidade","Métricas","Práticas","Scrum","Times"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":null,"summary":"Não sei se foi só conosco, mas no início quando começamos a estudar e nos aprofundar sobre as métricas em equipes ágeis, tudo parecia difícil de entender, as explicações eram confusas e faltava casos práticos para entender e se inspirar.\r\nNo dia a dia as perguntas acabavam sendo sobre a entrega dos resultados e tínhamos dificuldade de conectar os pontos e entender que as métricas de fluxo são na verdade uma aproximação das métricas de resultado.\r\nSe você também está neste cenário, onde tem dificuldade de entender na prática a maneira certa de usar as métricas, então esta palestra é para você!\r\nNesta palestra, compartilharemos de forma simples e prática como as métricas podem ser aplicadas em diferentes níveis (uma equipe, várias equipes) usando exemplos reais.","mechanics":"Segue abaixo o script da nossa apresentação e como vamos engajar a audiência:\r\n~ 5 Minutos \r\nTópico: Porque as métricas de de fluxo são um proxy para as métricas de resultado e o que esperar da palestra\r\nHighlights: Porque eu preciso entender o fluxo sistêmico e os resultados?\r\n\r\n˜ 10 minutos\r\nTópico: Insights que descobrimos na prática e que você provavelmente não sabe ou não percebeu (ainda)? \r\nExplicação sobre sobre casos práticos em múltiplos times e os desafios que já enfrentamos.\r\nHighlights: Como as métricas são importantes para evoluir a maturidade do time? Como investigar a saúde da equipe com um grupo de métricas? Como criar uma uma prática/cultura orientada a dados em equipes ágeis?\r\n\r\n˜ 5 minutos\r\nTópico: Qual a correlação entre o leadtime e os resultados de negócio?\r\nHighlights: Porque isso é real e como identificar, analisar e atuar com base no Leadtime? Vamos mostrar alguns exemplos reais e análises práticas.\r\n\r\n˜10 minutos\r\nGeneral: Métricas de times e a importância delas para a melhoria contínua \r\nHighlights: O que é mais importante e como fazer análises cruzando Leadtime, Throughput e o Coeficiente de variação e o tamanho da equipe?\r\n\r\n˜10 minutos\r\nTópico: Como sustentar os resultados e as melhorias no longo prazo\r\nHighlights: Explorar as armadilhas e como é difícil manter a organização melhorando no longo prazo.\r\n\r\n˜5 minutos - Resumir os principais takeaways\r\n˜5 minutos - Perguntas e respostas","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-12T15:55:01-03:00"},{"id":2464,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2464-org-stories-antipadroes-no-design-organizacional","title":"Org Stories - Antipadrões no Design Organizacional","authors":[{"user_id":2766,"user_uri":"https://submissoes.agilebrazil.com/users/2766-rodbastos","username":"rodbastos","name":"Rodrigo Bastos","gravatar_url":"https://gravatar.com/avatar/c3dc25280ed5aee6b161ead097c1485f.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3260,"user_uri":"https://submissoes.agilebrazil.com/users/3260-eduardomontenegro","username":"eduardomontenegro","name":"Eduardo Montenegro","gravatar_url":"https://gravatar.com/avatar/cae9e9003f1c8f79ccfc4e4c190747d5.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Experiência em organizações e como elas operam. Sabe ou já ouviu falar de padrões e antipadrões.","tags":["Cultura","Fracasso","Gestão","Padrões","Práticas","Transformação"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":50,"summary":"Para que o termo \"visão sistêmica\" deixe de ser um chavão, profissionais que trabalham com mudanças e transformação organizacional precisam compreender sistemas sociais. Uma importante capacidade nesse campo de conhecimento é a de enxergar antipadrões no design organizacional. \r\n\r\nNeste workshop você terá a oportunidade de jogar um card game chamado Org Stories. Com ele você entrará em contato com diferentes antipadrões relacionados ao design organizacional e discutir sobre como esses antipadrões podem afetar a capacidade da organização em geral valor e realizar seu propósito.","mechanics":"20’ Apresentação introdutória sobre o tema. Explicação do Jogo. \r\n\r\n50’ Separamos a turma em grupos de 5 pessoas. Entregamos 5 cartas diferentes para cada grupo. O jogo se inicia e é jogado de maneira independente em cada grupo. Um participante pega uma carta do deck, lê um lado da carta e abre para perguntas que são respondidas com sim, não ou irrelevante. A rodada segue até o grupo descobrir o antipadrão que está descrito no outro lado da carta e que gerou aquela situação inusitada descrita inicialmente. Outro participante pega outra carta e mais uma rodada se inicia. Entre as rodadas os participantes são encorajados a discutir o antipadrão e se/como ele se manifesta em sua realidade. \r\n\r\n35’ Voltamos para a plenária, abrindo para alguns grupos trazerem questionamentos, insights e surpresas. \r\n\r\n5’ Fechamento dos facilitadores, com sorteio de dois decks de cartas do *Org Stories*.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-15T17:13:11-03:00"},{"id":2470,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2470-lean-product-funel-construindo-o-produto-de-software-enxuto","title":"Lean Product Funel - Construindo o produto de software enxuto","authors":[{"user_id":1167,"user_uri":"https://submissoes.agilebrazil.com/users/1167-nevesm","username":"nevesm","name":"Marcelo Neves","gravatar_url":"https://gravatar.com/avatar/c6a74019120b64ef24345a96a737863e.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimentos básicos de métodos ágeis","tags":["Análise de negócio","Negócios","Inception","Lean","Método","Mindset","MVP","Práticas","Produto","Requisitos"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":50,"summary":"O Funil do Produto Enxuto é uma abordagem para definição e refinamento do escopo do software. Nosso maior desafio na criação de produtos de software é preponderantemente identificar aquilo que não precisa ser feito.\r\n\r\nO Funil do Produto Enxuto utiliza a metáfora de um funil. Primeiramente o time cria o funil, composto dos elementos fundamentais de um produto de software. Uma vez criado, a cada solicitação feita, o funil é utilizado para identificar (filtrar) se aquilo que é demandado é válido ou não. E, somente as solicitações que passam pelo funil são validadas e implementadas pelo time.\r\n\r\nVocê tem problemas com o backlog que não para de crescer? Precisa se certificar de que a demanda feito pelo cliente é válida? Então você precisa conhecer o Funil do Produto Enxuto.","mechanics":"O processo deste workshop funciona da seguinte maneira:\r\n\r\n1 - Os participantes serão divididos em grupos e cada grupo criará um hipotético produto de software. O facilitador irá sugerir a criação de um produto direcionado para aficcionados por futebol.\r\n\r\n2 - Nesta etapa os participantes serão convidados a criar o funil do produto. O funil do produto é um conjunto de definições (publico alvo, problemas que o produto resolve, métricas e etc.). A criação do funil do produto utiliza  o Lean Reqs Canvas que será utilizado posteriormente para validar as demandas. O Lean Reqs Canvas é utilizado para capturar informações para um melhor entendimento do que o cliente demanda do time que irá criar o produto de software.\r\n\r\n 3 - Nesta etapa o facilitador irá solicitar várias modificações no produto. E o time irá validar as demandas utilizando para isso o funil do produto enxuto. Algumas demandas serão aceitas e outras não. O aceite da demanda irá gerar vários insights do porquê aquela demanda não é válida. Pode ser que não resolva diretamente uma dor de uma parte interessada. Pode ser que a demanda não responde contribui para o produto resolver algum problema de negócio. No fim desta etapa o time terá uma ferramenta para levar para casa que o ajudará durante o processo de descoberta.\r\n\r\n4 - Nesta etapa será feita uma sessão de lições aprendidas onde serão revistos os conceitos de funil do produto enxuto, como validar uma demanda para um produto de software e quais são os elementos fundamentais de mim produto de software que devem ser investigados e trabalhados ao longo do processo de descoberta.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-16T10:59:54-03:00"},{"id":2474,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2474-todas-as-vezes-que-usei-as-metricas-do-time-para-o-mal","title":"Todas as vezes que usei as métricas do time para o mal","authors":[{"user_id":3113,"user_uri":"https://submissoes.agilebrazil.com/users/3113-cartolina","username":"cartolina","name":"Carolina Serpejante","gravatar_url":"https://gravatar.com/avatar/359332d4498b9c455e17139801e08d11.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"entender conceito de TH, leadtime, WIP","tags":[],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"Um belo dia descobri que era apaixonada por gráficos e planilhas, fontes infinitas de informação valiosa e iluminada. Com ajuda das métricas pensei que mudaria o mundo - e até mudei alguns, porém fiz muita porcaria no caminho. Estou aqui pra contar todas as vezes que manipulei dados ou usei métricas para os propósitos errados e as consequências que sofri, para que vocês não precisem passar pelo mesmo.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-16T14:10:48-03:00"},{"id":2485,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2485-deploy-nao-e-release-implementando-cd-sem-riscos-para-o-negocio","title":"Deploy não é Release: implementando CD sem riscos para o negócio","authors":[{"user_id":2553,"user_uri":"https://submissoes.agilebrazil.com/users/2553-acbarbosa","username":"acbarbosa","name":"Alexandre Barbosa","gravatar_url":"https://gravatar.com/avatar/99729a613f7a8d847d55a95f376f1b62.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":2557,"user_uri":"https://submissoes.agilebrazil.com/users/2557-melina","username":"melina","name":"Melina Deraldo dos Santos","gravatar_url":"https://gravatar.com/avatar/e7e4f241daac5dd493d8ac304a7f5289.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Experiência em desenvolvimento e implantação de sistemas","tags":["Automação","Gestão de Mudanças","DevOps","Melhoria","Maturidade","Práticas","Processo","Qualidade","Riscos","Escala","Estratégia"],"duration_mins":50,"session_type":"Debate","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":40,"summary":"Release é Deploy? Deploy é Release?\r\n\r\nPara sanar essa grande questão da engenharia de software, nesta sessão propomos uma conversa aberta para diferenciarmos estes dois termos e entendermos o impacto de cada um desses termos no processo de engenharia de software.\r\n\r\nAlém disso, como tornar cada uma dessas etapas independentes de forma a facilitar a entrega do software e gerar valor mais rápido ao usuário?\r\n\r\nComo essa diferenciação influência nos processos ágeis utilizados pelo negócio e/ou engenharia?\r\n\r\nEssas são umas das questões que queremos responder durante esta sessão.","mechanics":"Vamos utilizar o modelo de Fishbowl que permite que os participantes tragam suas experiências e contribuam para a resposta do nosso debate. Além disso o formato de Fishbowl irá nos permitir ampliar o nosso debate para questões do dia a dia e adicionarmos de forma prática, com evidências, como podemos separar esses dois termos.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-18T08:41:40-03:00"},{"id":2494,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2494-threat-modeling-como-nao-deixar-seguranca-apenas-para-o-final","title":"Threat Modeling: como não deixar segurança apenas para o final?","authors":[{"user_id":3065,"user_uri":"https://submissoes.agilebrazil.com/users/3065-thaiibraga","username":"thaiibraga","name":"Thaiane Braga","gravatar_url":"https://gravatar.com/avatar/6fa9c89794615c0b986e64dc43ebd68c.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3284,"user_uri":"https://submissoes.agilebrazil.com/users/3284-rvsilva","username":"rvsilva","name":"Ruan Victor da Paixão Silva","gravatar_url":"https://gravatar.com/avatar/61cea3275669ee91b3093a058969189e.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Nenhum pré-requisito","tags":["Cultura","Facilitação","Melhoria","Planejamento","Práticas","Processo","Produto","Projeto","Riscos","Times"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":30,"summary":"Você já tentou conversar sobre segurança com sua equipe, incluindo negócio, desenvolvedores e clientes? Geralmente não sabemos por onde começar.\r\n\r\nÉ incontestável a necessidade de manter sistemas seguros, bem como os impactos altos por cada falha de segurança explorada. Entretanto, identificar as vulnerabilidades e prioriza-las junto com o desenvolvimento é um desafio comum nos times.\r\n\r\nO Threat Modeling possibilita uma conversa dinâmica e interativa com foco em segurança adequado para o seu projeto. Com ajuda de diagramas e alguns post its, é possível identificar as vulnerabilidades com maior impacto no contexto do projeto, priorizar em conjunto com negócio e derivar tarefas para mitigá-las.\r\n\r\nDe uma forma simples e contínua, a cultura de segurança irá amadurecer a cada sessão.","mechanics":"A proposta inicial da sessão segue abaixo. Ela pode ser adaptada conforme feedbacks.\r\n\r\nh2. Tópicos a serem abordados \r\n\r\nh3. Agenda \r\n* (10 min) Apresentação dos facilitadores e quebra gelo\r\n* (5 min) Por que falar sobre segurança?\r\n* (10 min) Modelagem de ameaças: alto nível\r\n* (15 min) Modelagem de ameaças de aplicação\r\n\r\n* (40 min) Dinâmica de Threat Modeling em grupo: 4 etapas\r\n** Contexto\r\n** Identificação de ameaças\r\n** Priorização risco vs impacto\r\n** Identificação de ações para mitigação\r\n* (10 min) Apresentação dos resultados pelos grupos\r\n\r\n* (10 min) Leitura das dúvidas coletados durante toda sessão em um quadro na sala\r\n* (10 min) Retrospectiva do que foi visto e encerramento\r\n\r\nh3. Organização do Público \r\n\r\nO público será organizado em 5 grupos de 5 ou 6 pessoas. Será priorizado a diversidade de papéis nos grupos.\r\n\r\nh3. Material utilizado \r\n\r\n* Fornecido pelos facilitadores:\r\n** Material de apoio com contexto de projetos para exercício\r\n** Material de apoio com diagramas de aplicações simples para exercício\r\n** Baralho Threat Modeling da Thoughtworks\r\n** Flipchart\r\n** Post its\r\n** Canetas\r\n** Projetor","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-20T00:26:25-03:00"},{"id":2511,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2511-gestao-de-produtos-em-constante-transformacao","title":"Gestão de produtos em constante transformação","authors":[{"user_id":3160,"user_uri":"https://submissoes.agilebrazil.com/users/3160-gabrielluisi","username":"gabrielluisi","name":"Gabriel Luisi","gravatar_url":"https://gravatar.com/avatar/b8ddead8f4577858e1572c211da52640.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":2859,"user_uri":"https://submissoes.agilebrazil.com/users/2859-gcorrea","username":"gcorrea","name":"Gabriela dos Santos Correa","gravatar_url":"https://gravatar.com/avatar/f0e879c2ba3c03c69163b3df930b72ab.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Interesse em gestão e concepção de produtos","tags":["Análise de negócio","Negócios","Cultura","Design","Hipóteses","Melhoria","Inception","Aprendizagem","Gestão","MVP","Práticas","Produto","Requisitos","Startup","Estratégia","UX"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"Falaremos como a gestão de produtos visa abordar a necessidade de adaptação e flexibilidade nestes novos tempos onde a indústria de tecnologia muda rapidamente. As empresas agora necessitam de respostas rápidas ao mercado, estando sempre atentos a reação dos usuários e adaptando os produtos para agregar cada vez mais valor. Vamos compartilhar ganhos e aprendizados que tivemos nestes anos trabalhando com empresas de pequeno, médio e grande porte, no Brasil e em outros países. Você também vai aprender técnicas que podem ajudar a planejar o seu produto de forma muito mais assertiva e valiosa.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-22T18:38:17-03:00"},{"id":2515,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2515-raio-x-agil-brasil","title":"Raio X Ágil: Brasil","authors":[{"user_id":1754,"user_uri":"https://submissoes.agilebrazil.com/users/1754-rafaela-m-fontana","username":"rafaela.m.fontana","name":"Rafaela Mantovani Fontana","gravatar_url":"https://gravatar.com/avatar/e11c9ba4e297e567ef8543d442d118f4.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecer métodos ágeis academicamente e/ou ter alguma experiência prática em processos ágeis","tags":[],"duration_mins":25,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"Como anda a agilidade no nosso país? Somos ágeis aqui no Brasil? Quais os métodos e práticas usados? Será que as pessoas sentem os mesmos desafios e benefícios que você? E os projetos, são bem-sucedidos? Coletamos dados de muitos profissionais de agilidade de vários locais do país e nessa talk iremos mostrar um diagnóstico da agilidade no Brasil. Você poderá conhecer os dados, comparar e refletir sobre a sua situação em relação aos demais profissionais do país. Os resultados da pesquisa ainda dão dicas dos caminhos que estes profissionais seguiram rumo à agilidade.","mechanics":"A palestra será conduzida na forma de exposição de slides com gráficos que demonstrem de forma clara os resultados da pesquisa. Ao longo da exposição será dada ênfase a alguns resultados específicos da pesquisa.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-22T20:14:20-03:00"},{"id":2524,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2524-como-acabar-com-seu-debito-tecnico","title":"Como acabar com seu débito técnico!","authors":[{"user_id":2548,"user_uri":"https://submissoes.agilebrazil.com/users/2548-fusca","username":"fusca","name":"Wagner Fusca Voltz","gravatar_url":"https://gravatar.com/avatar/e26d0367de2bbb06bf3059c981aea719.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Entender sobre o processo de produção de software","tags":["Código","Legado","Métricas","Práticas","Princípios e valores","Qualidade","Refatoração","Extreme Programming"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":null,"summary":"Seu time de desenvolvimento de software está com dificuldades no ágil? \r\nAlterar algo no código fonte é custoso?\r\n\r\nEstá difícil escalar a aplicação? O projeto parece engessado? Existe dúvida quanto a confiabilidade da cobertura de testes? Existem testes?\r\n\r\nAtrasos em entregas estão ficando constantes? A tecnologia está ficando defasada e as pessoas desenvolvedoras estão buscando novas tecnologias? Seu legado está cada vez mais pesado de administrar? \r\n\r\nPois bem, você tem débito técnico e eu vou mostrar como resolver este problema. É rápido, fácil e simples. \r\n\r\nMas para acabar com a sua dívida técnica é outra conversa! Disciplina, simplicidade, métricas e excelência técnica irão te ajudar com a dívida. Irei compartilhar como dar atenção a isto","mechanics":"Irei apresentar com o apoio de slides e utilizarei metáforas para fixar o entendimento deste tema. \r\n\r\nO objetivo é usar uma linguagem compreensível e não tão técnica.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-23T01:48:36-03:00"},{"id":2528,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2528-os-3-vs-na-estrategia-de-criacao-de-produtos-digitais","title":"Os 3 Vs na Estratégia de criação de Produtos Digitais","authors":[{"user_id":1742,"user_uri":"https://submissoes.agilebrazil.com/users/1742-rodrigosilvap","username":"rodrigosilvap","name":"Rodrigo Silva Pinto","gravatar_url":"https://gravatar.com/avatar/009fc6a7fcf18338f0df65be36c71753.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimentos na área de produto ajudam, mas não são pré-requisitos","tags":["Hipóteses","Inception","Gestão","Métricas","MVP","Planejamento","Produto","Projeto","Requisitos","Scrum","Estratégia"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"Peter Drucker disse: \"Fazer a coisa certa é mais importante do que fazer certo as coisas.\"\r\nNa criação de produtos é mais importante focar em O QUÊ fazer do que no COMO fazer.\r\nA proposta é o explorar os 3 Vs da Estratégia na criação de Produtos Digitais:\r\n- Visão: como delimitar um norte a ser perseguido e alinhar os esforços nessa direção\r\n- Valor: sabemos que precisamos entregar valor para o cliente, mas as vezes não sabemos o que isso significa\r\n- Validação: nada é constante exceto a mudança, ou seja, temos que trabalhar com hipóteses e ciclos de curtos de feedback\r\nEm cada um dos pontos serão apresentadas ferramentas que ajudarão o audiência a implementar os conceitos.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-23T10:47:57-03:00"},{"id":2545,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2545-ajudando-quem-nao-sabe-programar-a-criar-expressoes-programaticas-atraves-de-interface","title":"Ajudando quem não sabe programar a criar expressões programáticas através de interface","authors":[{"user_id":3322,"user_uri":"https://submissoes.agilebrazil.com/users/3322-prixalcantara","username":"prixalcantara","name":"Priscila Alcântara","gravatar_url":"https://gravatar.com/avatar/3a0f836d0068211e03296fbef2139f65.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Nenhum","tags":["Design","Inovação","UX"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"Criar expressões lógicas, variáveis e condicionais podem ajudar pessoas de diversas áreas de atuação a tornar suas vidas melhores. No caso de quem vem da área de saúde, por exemplo, criar laudos médicos e outros documentos poderia ser uma atividade mais simples se fosse automatizada. Como ajudar quem não tem background de informática a fazer isso através de uma interface mais amigável do que uma série de linhas de comando? Esta apresentação visa demonstrar como uma equipe de design tornou isso possível utilizando técnicas de experiência do usuário.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-24T10:46:39-03:00"},{"id":2546,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2546-design-sprint-e-para-todo-mundo","title":"Design Sprint é para todo mundo","authors":[{"user_id":3322,"user_uri":"https://submissoes.agilebrazil.com/users/3322-prixalcantara","username":"prixalcantara","name":"Priscila Alcântara","gravatar_url":"https://gravatar.com/avatar/3a0f836d0068211e03296fbef2139f65.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3324,"user_uri":"https://submissoes.agilebrazil.com/users/3324-taisnascimento","username":"taisnascimento","name":"Taís dos Santos Nascimento","gravatar_url":"https://gravatar.com/avatar/0adb78b97111c6231202660968f6ec12.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Nenhum","tags":["Negócios","Design","Inovação","Processo","Projeto","Estratégia","Sucesso","UX"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":null,"summary":"É possível aplicar metodologias ágeis e inovadoras em grandes companhias com estrutura vertical como uma distribuidora de energia elétrica? Como o Design pode ajudar nisso? O objetivo desta palestra é mostrar que não só é possível fazer isso como quais são os benefícios de usar o método criado e aplicado pela Google Ventures.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-24T11:20:10-03:00"},{"id":2547,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2547-o-futuro-da-gestao-de-desempenho-de-empresas-digitais","title":"O Futuro da Gestão de Desempenho de Empresas Digitais","authors":[{"user_id":1007,"user_uri":"https://submissoes.agilebrazil.com/users/1007-raphaelmolesim","username":"raphaelmolesim","name":"Raphael Molesim","gravatar_url":"https://gravatar.com/avatar/16b78e6760fd7c8b9c281306f8b09266.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3323,"user_uri":"https://submissoes.agilebrazil.com/users/3323-rsujto","username":"rsujto","name":"Renata Sujto","gravatar_url":"https://gravatar.com/avatar/005da460e08350a96168381997977f97.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecer os modelo atuais de gestão de desempenho e a realidade organizacional de médias e grandes empresas","tags":["Cultura","Feedback","Metas","Grandes Empresas","Gestão","Mindset","Processo","Estratégia","Transformação"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Profundo (Pré requisitos são obrigatórios, e devem ser específicos)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":null,"summary":"Gestão de desempenho tem sido um dos impulsionadores chave em transformações de larga escala. Um dos principais mecanismos de reforço no processo de mudança precisa ser cuidadosamente analisado e modernizado. Ao passo que empresas deixam o antigo modelo de \"stack and rank\" e começam falar sobre novos modelos que emergem de empresas como Google, Atlassian, Netflix, entre outras. Aqui queremos discutir qual o futuro da gestão de performance que está se apresentando como tendência no mercado.","mechanics":"A mecânica será de apresentação com slides e alguns momento de interação com a platéia.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-24T12:18:30-03:00"},{"id":2556,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2556-gestao-da-diversidade-a-inclusao-de-pcds-em-cerimonias-ageis","title":"Gestão da Diversidade: a inclusão de PCDs em cerimônias Ágeis","authors":[{"user_id":2415,"user_uri":"https://submissoes.agilebrazil.com/users/2415-jbastos","username":"jbastos","name":"Joyce Bastos","gravatar_url":"https://gravatar.com/avatar/b855ebb9e3205638cf4adfd4aa96d9a8.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento nas dinâmicas ágeis como daily, review. retospectiva e planning","tags":["Gestão de Mudanças","Cultura","Gestão","Pessoas","Princípios e valores","Processo","Papéis e Responsabilidades"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"A palestra nasceu de um trabalho realizado em uma empresa de desenvolvimento de software que precisava cumprir a Lei de Cotas e com isso precisou contratar e reter 14 profissionais com deficiência. A empresa não estava preparada para receber e atuar com esses profissionais. Os gestores tinham muitas dúvidas de como agir e como incluir essas pessoas no contexto ágil. Por um período de dois anos participei de treinamentos e debates envolvendo PCDs, visitei empresas que já eram referência na área e aprendi sobre PCDs e leis . Ao final consegui reunir uma série de pequenas práticas e mudanças que podem serem feitas no dia a dia e assim facilitar a inclusão. Escolhi para esta palestra pequenas mudanças que podem acontecer já na execução das cerimônias agile, como daily, planning, review e retro","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-25T09:29:27-03:00"},{"id":2561,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2561-construindo-uma-base-de-codigo-solida","title":"Construindo uma base de código sólida","authors":[{"user_id":33,"user_uri":"https://submissoes.agilebrazil.com/users/33-giggio","username":"giggio","name":"Giovanni Bassi","gravatar_url":"https://gravatar.com/avatar/a494c4460f4a55fffac5cd563c232cb9.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Experiência sólida em desenvolvimento, e vivência em vários projetos diferentes","tags":["Arquitetura","Código","Design","Práticas","Qualidade","Estratégia"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Profundo (Pré requisitos são obrigatórios, e devem ser específicos)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":null,"summary":"Um dos maiores desafios do desenvolvimento de software é a evolução sustentável do projeto. Comumente o projeto não permite que o time entregue alta produtividade o tempo todo, tendo que resolver constantemente problemas ortogonais à criação de código em si.\r\nNessa palestra vou visitar algumas das práticas que tenho utilizado para criar projetos sustentáveis, do ponto de vista da codificação, dado que meu dia a dia tem sido de iniciar novos projetos com certa frequência.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":false,"created_at":"2019-04-25T17:58:16-03:00"},{"id":2563,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2563-fortaleca-o-coaching-interno-com-lean-spi-como-ajudar-suas-equipes-de-dev-de-forma-continua","title":"Fortaleça o Coaching Interno com LEAN-SPI: Como Ajudar suas Equipes de Dev. de Forma Contínua","authors":[{"user_id":2003,"user_uri":"https://submissoes.agilebrazil.com/users/2003-kleoson","username":"kleoson","name":"Bruno Corrêa","gravatar_url":"https://gravatar.com/avatar/8a6fe159314576795b5c7b7d1ea1da9b.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Agile, Lean Thinking, Melhoria Contínua de Processo","tags":["Coaching","Facilitação","Melhoria","Lean","Maturidade","Processo","Transformação"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"Atualmente, muitas empresas recorrem à consultorias para melhorarem seu desempenho técnico, seu Mindset ágil e quem sabe até trilhar uma Transformação Ágil. Legal... até o momento do consultor se despedir e depois de 3 meses tudo estagna ou “desanda” ☹. Quem já passou por isso sabe o desafio que é manter o Agile “vivo” dentro da empresa, bem como, promover o Kaizen nas equipes. \r\n\r\nNesse sentido, Investir no Coaching Interno pode ser uma ótima estratégia para manter a Agilidade em constante evolução dentro da sua empresa. Blz, mas como fazer isso na prática?\r\n\r\nEsta talk apresentará o Lean-SPI: um método ágil que alguns Analistas da Unidade de Dev. de Software do Ministério Público do Pará estão utilizando para manter o Agile “vivo” e em constante evolução junto às suas equipes de Dev.","mechanics":"Para uma apresentação de 25min, posso quebrar em duas partes:\r\n\r\n1 º Parte:\r\n- Contextualizar sobre o cenário de empresas que recorrem à consultorias em métodos ágeis;\r\n- Contextualizar sobre o Papel do Agile Coaching, o quanto ele é desafiador e importante dentro da empresa para ajudar as equipes no caminho da agilidade;\r\n\r\n2º Parte:\r\n- Apresentar a fundamentação, ciclo de vida e princípios do método Lean-SPI;\r\n- Apresentar, de forma macro e com imagens, o funcionamento do método Lean-SPI;\r\n- Finalizar compartilhando alguns resultados obtidos com a adoção deste método;","status":"Aguardando confirmação","author_agreement":null,"image_agreement":null,"created_at":"2019-04-25T19:14:47-03:00"},{"id":2567,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2567-cd-mobile-no-nubank-do-merge-ate-a-loja","title":"CD Mobile no Nubank: do merge até a loja","authors":[{"user_id":1448,"user_uri":"https://submissoes.agilebrazil.com/users/1448-vbandrade","username":"vbandrade","name":"Vini Andrade","gravatar_url":"https://gravatar.com/avatar/b4748c08059c14238a4d81488a4f8c51.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento basico sobre pipelines de continuous deployment","tags":["Código","Práticas","Processo"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":null,"summary":"Como o app do Nubank é shipado? Falaremos sobre como funcionam os repositorios, build, teste, deploy e release dos apps. Falaremos das dificuldades que enfrentamos devido ao crescimento da equipe e da variedade tecnologias utilizadas em cada plataforma, e também das soluções que implementamos para permitir qualquer mudança chegar na loja de forma confiável, sem comprometer a qualidade dos apps e como isso impact a autonomia das equipes.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-26T04:40:17-03:00"},{"id":2569,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2569-entrega-continua-como-atingir-a-alta-performance-em-software-delivery","title":"Entrega Contínua: Como atingir a alta performance em software delivery","authors":[{"user_id":3334,"user_uri":"https://submissoes.agilebrazil.com/users/3334-rafaelspereira","username":"rafaelspereira","name":"Rafael Pereira","gravatar_url":"https://gravatar.com/avatar/970f13f7f6354724b639dcbfa188befb.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimentos de práticas de DevOps e de práticas de desenvolvimento ágil","tags":["DevOps","Melhoria","Grandes Empresas","Gestão","Métricas","Processo"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":null,"summary":"Construir um pipeline de continuous delivery nem sempre é suficiente para atingirmos a excelência e alta performance em entrega de software. Na prática, ele é apenas uma das partes. Nessa sessão iremos discutir como combinar um pipeline de continuous delivery com outras práticas de engenharia e devops, de processo de desenvolvimento, de acompanhamento de métricas, entre outras, para aumentarmos a performance da entrega. Além disso, iremos mostrar um case prático de como estamos transformando o processo de desenvolvimento na Globo.com utilizando estes fundamentos.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-26T10:00:10-03:00"},{"id":2570,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2570-tecnicas-de-estimativa-de-tamanho","title":"Técnicas de Estimativa de Tamanho","authors":[{"user_id":2006,"user_uri":"https://submissoes.agilebrazil.com/users/2006-andersonhummel","username":"andersonhummel","name":"Anderson Diniz Hummel","gravatar_url":"https://gravatar.com/avatar/65e1107ccb7e596e3ef7f955b70b000f.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Ter estimado uma unidade de trabalho.","tags":["Métricas"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":100,"summary":"Nesta palestra vamos te ajudar a responder a pergunta mais temida: Quanto tempo você precisa para fazer isto?","mechanics":"Estrutura da apresentação\r\n\r\n1) Definição de Estimativa (5 min)\r\nSão apresentadas definições assim como um quiz com a plateia\r\n2) Cone da incerteza (10 min)\r\nÉ explicado o conceito de cone da incerteza\r\n3) Estimativa de Tamanho (5 minutos)\r\nÉ explicado o conceito de estimativa de tamanho e a diferença com outros tipos de métricas.\r\n4) Estimativa por dia/hora Ideal e Capacidade (10 minutos)\r\nÉ explicado o conceito de dia/hora ideal e o conceito de cálculo de capacidade. É aplicado a técnica de capacity calculator do David Prior.\r\n5) Estimativa por comparação (10 minutos)\r\nÉ explicado o conceito de estimativa por comparação assim é feita uma dinâmica sobre estimativa de comparação de altura\r\n6) Técnicas de estimativa de comparação (10 minutos) \r\nSão explicadas diferentes técnica de estimativas por comparação.\r\n7) Técnica de Estimativa em lote (30 minutos)\r\nO fluxo de estimativa (incerteza, complexidade, esforço) é aplicado no tempo de preparação de uma lista de alimentos.\r\n8) Estimativa por throput (10 min)\r\nSão explicadas técnicas de estimativa por throput. Os grupos recebem uma base de dados e são convidados a calcular o tamanho médio usando as técnicas explicadas.\r\n9) QA (20 minutos)\r\n\r\nLayout da sala\r\nOs participantes precisa estar sentados em mesas circulares\r\n\r\nApresentação\r\nSerá utilizada a técnica de projeção de flipcharts para explicar o conteúdo\r\n\r\nNúmero de pessoas\r\nPragmaticamente, essa estrutura já foi executada em um CSM com 80 alunos. A dinâmica deve escalar até 120 participantes.","status":"Aguardando confirmação","author_agreement":null,"image_agreement":null,"created_at":"2019-04-26T13:46:57-03:00"},{"id":2571,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2571-kata-de-melhoria-nao-e-template-e-forma-de-pensar","title":"Kata de Melhoria: não é template, é forma de pensar.","authors":[{"user_id":3262,"user_uri":"https://submissoes.agilebrazil.com/users/3262-antoniogerent","username":"antoniogerent","name":"Antonio Gaspar Gerent Júnior","gravatar_url":"https://gravatar.com/avatar/7e22dd79cd945c59a3f8c782b8e2c2d5.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":2094,"user_uri":"https://submissoes.agilebrazil.com/users/2094-marigraf","username":"marigraf","name":"Mariana Graf","gravatar_url":"https://gravatar.com/avatar/69c9513347c0429615425cd0d44ef6a8.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Nenhum","tags":["Fora da TI","Gestão de Mudanças","Cultura","Hipóteses","Melhoria","Lean","Aprendizagem","Gestão","Método","Mindset","Padrões","Práticas","Processo"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":32,"summary":"Melhoria contínua, kaizen, “hoje melhor do que ontem, amanhã melhor do que hoje!”.\r\nTodos nós já ouvimos estas coisas, mas como podemos estruturar e orientar nosso pensamento e comportamento a isto? Neste workshop vamos colocar a mão na massa [ou melhor, no quebra-cabeça] para exercitar o pensamento científico e a experimentação como uma forma [o tal kata] de processo de melhoria contínua com o método desenvolvido por Mike Rother, autor do livro Toyota Kata,","mechanics":"A mecânica básica do workshop é um desafio de montagem de quebra-cabeça em grupos de 4 a 5 pessoas. O layout necessário para sala é de uma mesa por grupo de forma espalhada na sala.\r\n\r\nCada grupo terá uma pessoa resposável por medir o tempo e outra fazendo as anotações, porém elas também participam da montagem do quebra cabeças.\r\n\r\nIniciamos com uma conexão entre as pessoas e o conceito de melhoria contínua.\r\n\r\nLogo após, fazemos a apresentação das regras, e duas rodadas de nivelamento e coleta de tempos para iniciar as conceitualizações que serão feitas com slides.\r\n\r\nApós este início, fazemos rodadas de experimentação orientada por pensamento científico e debates com pequenos conceitos e lições aprendidas em cada rodada.\r\n\r\nFinalizamos com um fechamento de aprendizados, feedbacks e coisas que “podemos começar na segunda feira”.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-26T14:43:38-03:00"},{"id":2574,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2574-como-co-criar-e-remover-barreiras-por-meio-do-design-thinking-no-setor-publico","title":"Como co-criar e remover barreiras, por meio do Design Thinking, no setor público","authors":[{"user_id":3356,"user_uri":"https://submissoes.agilebrazil.com/users/3356-bertholi","username":"bertholi","name":"Brucy Bertholi","gravatar_url":"https://gravatar.com/avatar/2cf3f09c60ed6e70ed53dd6531f64d92.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimentos básicos em agilidade","tags":["Análise de negócio","Negócios","Cultura","Design","Governo","Inception","Mindset","Times","Transformação","UX"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"Diariamente temos que lidar com pessoas, seja no seu time ou fora dele. O Design Thinking tem se tornado um ótimo aliado quando precisamos conduzir e guiar pessoas, para a resolução de problemas complexos com soluções criativas e colaborativas.\r\nCom um case real eu quero compartilhar porque a empatia, experimentação e a colaboração são pilares que podem ajudar na descoberta e solução de problemas de uma forma diferente, criativa e mais leve, também no setor público. Além disso, irei apresentar ferramentas que auxiliam a pensar no problema antes da solução, engajando o time e o cliente para conquistar resultados de forma mais assertiva e ágil.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-26T15:32:48-03:00"},{"id":2589,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2589-scrum-patterns-a-guided-tour","title":"Scrum Patterns: A Guided Tour","authors":[{"user_id":1747,"user_uri":"https://submissoes.agilebrazil.com/users/1747-yodaman","username":"yodaman","name":"Joseph Yoder","gravatar_url":"https://gravatar.com/avatar/ca080bf5bba71ae8a2deb1291dad3307.png?s=48\u0026d=mm","default_locale":"en"}],"prerequisites":"Requirements: Understanding of basic agile principles. Knowledge and some practical experience with Scrum is beneficial. Organizations with already formed Scrum teams will get many benefits from this.","tags":["Planejamento","Práticas","Princípios e valores","Processo","Papéis e Responsabilidades","Escala","Scrum","Auto-organização"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Profundo (Pré requisitos são obrigatórios, e devem ser específicos)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":null,"summary":"Scrum has been adopted by many within the agile community. There are various certifications, courses, and literature about Scrum such as CSM, CSPO and the Scrum Guide. Scrum teams get some limited success by starting with background either from some courses and/or researching the core ideas from available material on the topic. To get the full benefits of Scrum and move beyond the basics, there is more detailed knowledge on practicing and adapting Scrum to your environment and needs. Starting from “The Mist”, I’ll do a guided tour through Scrum patterns by the ScrumPLoP community. This talk will visit the key Scrum Patterns so that it will be easier for the participants to “see” how to “self-organized teams” to develop “the right product” adding value following the “Spirit of Scrum”.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-26T18:41:57-03:00"},{"id":2592,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2592-no-estimates-game","title":"No Estimates Game","authors":[{"user_id":3297,"user_uri":"https://submissoes.agilebrazil.com/users/3297-prilupj","username":"prilupj","name":"Priscila Luana de Souza Rocha","gravatar_url":"https://gravatar.com/avatar/1deb622ea8f2a93efb8d95de982c441c.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3351,"user_uri":"https://submissoes.agilebrazil.com/users/3351-raoliveira","username":"raoliveira","name":"Rafael de Almeida Oliveira","gravatar_url":"https://gravatar.com/avatar/12a500590c5550882cd1e84e8f7c61dc.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"N/A","tags":["Gestão de Mudanças","Estimativa","Facilitação","Kanban","Lean","Aprendizagem","Gestão","Maturidade","Métricas","Mindset","Planejamento","Práticas","Estratégia","Times"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":32,"summary":"Em geral, quando nos deparamos com o desafio de realizar estimativas em projetos de software, estamos tentando responder à famosa pergunta: \"Quando é que vai ficar pronto?\". Seja para uma feature, seja para um pacote de trabalho ou até mesmo para um grande projeto. Neste jogo, vamos abordar esse desafio de uma maneira lúdica, simulando o dia a dia de vários times de projetos, com dependências entre si. Para isso, utilizaremos um jogo de tabuleiro, com obstáculos e riscos inesperados, trazendo técnicas e ferramentas que ajudarão a dar mais confiança para a resposta da pergunta inicial.","mechanics":"Cronograma\r\n10 ~ 15 minutos: Apresentação inicial para explicar as regras do jogo. \r\n60 minutos: Execução do jogo. Durante o jogo, vamos simular o dia-a-dia de times de projetos, que terão o objetivo de realizar o desenvolvimento de um software específico. O jogo trará desafios de planejamento, gestão de riscos, alocação de esforços durante as iterações e uma série de outras possibilidades que estão presentes em um time real. Cada equipe terá um tabuleiro que simula um kanban, com as ferramentas utilizadas no jogo, cards de tarefas, dependências, eventos, burnup e scatterplot de preenchimento manual, indicador de bloqueio ou desbloqueio de tarefas, dados, identificação de papéis no time e contador de dias. Vamos apoiar os times durante a execução com provocações, questionamentos e eventos inesperados.\r\n15 ~ 30 minutos finais: fechamento do jogo, com um momento de discussão entre os participantes, além de um tempo para apresentação de conclusões e aprendizados com a dinâmica do jogo.","status":"Aceita","author_agreement":true,"image_agreement":false,"created_at":"2019-04-26T18:58:46-03:00"},{"id":2593,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2593-das-personas-aos-requisitos-do-produto-canvas-proposta-de-valor-como-gerador-de-backlog","title":"Das personas aos requisitos do produto: Canvas proposta de valor como gerador de backlog","authors":[{"user_id":3360,"user_uri":"https://submissoes.agilebrazil.com/users/3360-rodrigolcsouza","username":"rodrigolcsouza","name":"Rodrigo Souza","gravatar_url":"https://gravatar.com/avatar/dd66fa6c4e2c1eba07e93852006ec8c9.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento básico sobre ciclo de construção de um produto digital e sobre canvas","tags":["Design","Lean","MVP","Práticas","Produto","Projeto","Requisitos","Startup","UX"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"Criar requisitos em um ambiente lean está relacionado a agilidade e flexibilidade com ferramentas e processos. Persona é uma ferramenta poderosa para construção de produtos e serviços, entretanto ainda existe muito desentendimento sobre o seu uso. Canvas proposta de valor ajuda no processo de criação de negócios, seu uso principal é para verificar ideias de negócios através de um fit entre produtos e usuário.  \r\n\r\nQuando se tem pouco tempo e pessoal, muita informação de pesquisa e a urgência de ter um backlog há ser priorizado pela equipe e cliente, como resolver isso? Testei unir essa ferramenta (persona) com uma versão adaptada do canvas de proposta de valor para montar requisitos básicos. \r\n\r\nFuncionou! \r\n\r\nAssim, em uma semana, saímos do 0 ao backlog para iniciar a sprint!","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-26T19:37:26-03:00"},{"id":2597,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2597-evolucionando-kanban-como-gestor-da-transformacao-organizacional","title":"Evolucionando: Kanban como gestor da transformação organizacional","authors":[{"user_id":3199,"user_uri":"https://submissoes.agilebrazil.com/users/3199-mimiteo","username":"mimiteo","name":"Michelle Teodoro","gravatar_url":"https://gravatar.com/avatar/0e517d08f75a6e74c3be2dc18a28ebc5.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento o que é método Kanban e sobre o STATIK (Systems Thinking Approach to Implementing Kanban)","tags":["Gestão de Mudanças","Cultura","Melhoria","Inovação","Kanban","Grandes Empresas","Maturidade","Mindset","Portfólio","Estratégia"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":null,"summary":"Um dos grandes desafios da implementação ágil é a mudança da cultura organizacional. Como mudar práticas já enraizadas? Como não ferir a identidade das pessoas e dos times? Esse é o caso da implementação ágil em uma organização global centenária, mostrando o uso do Kanban como o grande gestor da mudança e alavancador das práticas ágeis. Sim! O Kanban como gestor da transformação organizacional em equipes tradicionais está mudando as práticas e processos e progressivamente impulsionando a agilidade. Venha saber como o STATIK está trazendo a mudança evolucionária, ao ponto de nos tornarmos um modelo de sucesso da transformação ágil em um nível global na empresa.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-26T22:17:20-03:00"},{"id":2601,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2601-xp-na-pratica-workshop-com-codigo-para-quem-nao-programa","title":"XP na prática: workshop com código para quem não programa","authors":[{"user_id":2377,"user_uri":"https://submissoes.agilebrazil.com/users/2377-luizphr","username":"luizphr","name":"Luiz (Lula) Rodrigues","gravatar_url":"https://gravatar.com/avatar/3d2df75a2075dd430dc46db4f6433458.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":2368,"user_uri":"https://submissoes.agilebrazil.com/users/2368-afucher","username":"afucher","name":"Arthur Fücher","gravatar_url":"https://gravatar.com/avatar/98d6b90a67cab3fb3924747158d0d14c.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Nenhum","tags":[],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":20,"summary":"A agilidade nasceu no desenvolvimento de software, não há como negar. Também não há como negar que a agilidade está cada vez mais distante das linhas de código. Este workshop não tem a pretensão de te transformar em um Kent Beck ou Martin Fowler, mas vai pelo menos ajudar você (que nunca programou ou que não programa há muito tempo), de uma forma simples, segura e divertida, a aprender práticas do Extreme Programming usando código de verdade. Acredite: aquele seu produto maneiro não vai ser maneiro sem boas práticas de engenharia. Venha sujar as mãos conosco! Não precisa trazer seu computador, e nem saber programar. ;)","mechanics":"Utilizaremos o formato de Dojo Randori, com um desafio bem simples trazido na forma de User Story pelo Product Owner, interpretado por um de nós, afim de gerar empatia com o dia-a-dia das pessoas que estão participando da sessão. \r\n\r\nO desafio será resolvido utilizando o fluxo do TDD e orientando-se sempre pela visão do negócio. O ciclo de “escrever um teste e falhar”, “escrever uma solução bem simples” e “melhorar o que conseguirmos” ajudará os participantes a se sentirem a vontade para errar e aprender com os erros. \r\n\r\nCada dupla (quem está pilotando e quem está navegando) trabalhará por 4 minutos. Quem está pilotando passará a navegar, e alguém da plateia, de forma voluntária, passará ao posto de piloto. Toda a mágica acontece entre estas trocas, pois a cada 4 minutos pararemos para discutir todas as dúvidas, comentários e sugestões sobre o que está sendo feito. Quem estiver pilotando ou navegando poderá o tempo todo pedir ajuda da plateia. Colaboração é a chave para as interações sociais. E interações sociais são a chave para trazer diversidade à agilidade e ao XP.\r\n\r\nSpoiler: Existe também um easter-egg no workshop. Caso apareçam pessoas que já desenvolvem, estas, além de aprender mais sobre XP, também aprenderão sobre como criar um ambiente seguro para pessoas não técnicas. ;)","status":"Aceita","author_agreement":true,"image_agreement":false,"created_at":"2019-04-27T08:41:09-03:00"},{"id":2620,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2620-sre-decisoes-de-software-com-metricas-de-performance-e-resiliencia","title":"SRE: Decisões de software com métricas de performance e resiliência","authors":[{"user_id":3365,"user_uri":"https://submissoes.agilebrazil.com/users/3365-vierno","username":"vierno","name":"Guilherme Vierno","gravatar_url":"https://gravatar.com/avatar/2db3e8dbeba16cf571e1211fd0bd0b04.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento básico de sistemas web, como funciona uma requisiçaão http, o que é um status de erro, etc.","tags":["Cultura","Data","DevOps","Métricas","Planejamento","Práticas"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":null,"summary":"Nesta talk irei explorar os conceitos de métricas para tomada de decisão baseada em performance e resiliência de aplicações. A estratégia que irei mostrar é baseada nos ensinamentos da implementação de DevOps do Google (Site Reliability Engineering). Usarei exemplos reais da implementação de tais métricas na globo.com, focando nos nossos resultados e aprendizados.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T15:08:55-03:00"},{"id":2632,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2632-adocao-agil-relato-de-experiencia-de-2-times-distribuidos","title":"Adoção ágil: relato de experiência de 2 times distribuídos","authors":[{"user_id":2501,"user_uri":"https://submissoes.agilebrazil.com/users/2501-frederico-oliveira","username":"frederico.oliveira","name":"Frederico Oliveira","gravatar_url":"https://gravatar.com/avatar/5659853d6c105644c6521dbf7586baef.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3393,"user_uri":"https://submissoes.agilebrazil.com/users/3393-tiagocv","username":"tiagocv","name":"Tiago Vidal","gravatar_url":"https://gravatar.com/avatar/5d94886b909fad0ac4b51791c9d29464.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Não há","tags":["Kanban","Grandes Empresas","Liderança","Gestão","Management 3.0","Mindset","Planejamento","Práticas","Princípios e valores","Scrum","Auto-organização","Transformação"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"Nesta apresentação há os principais relatos sobre a experiência na adoção ágil de 2 times distribuídos (SIDI/Campinas-SP e Cin-UFPE/Recife-PE), mas que trabalham em conjunto no desenvolvimento de soluções em geral para a SAMSUNG. As mudanças que uma adoção ágil traz, impactam desde na forma como o cliente e times se interagem até mesmo na maneira em que os membros dos times desempenham seus trabalhos. Destacam-se a como o cliente está sendo integrado no andamento dos projetos para ser criado o produto correto, bem como experiências relacionadas aos times, como eliminação dos desperdícios, microgerenciamento versus transparência versus autonomia considerando 2 times remotos de diferentes empresas, e aspectos sobre qualidade de software (ciclos de testes, DevOps, dentre outras iniciativas).","mechanics":"","status":"Aguardando confirmação","author_agreement":null,"image_agreement":null,"created_at":"2019-04-27T17:17:55-03:00"},{"id":2637,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2637-okrs-um-ano-de-licoes-aprendidas-e-decisao-de-continuar-em-2019","title":"OKRs: um ano de lições aprendidas e decisão de continuar em 2019.","authors":[{"user_id":2094,"user_uri":"https://submissoes.agilebrazil.com/users/2094-marigraf","username":"marigraf","name":"Mariana Graf","gravatar_url":"https://gravatar.com/avatar/69c9513347c0429615425cd0d44ef6a8.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":2927,"user_uri":"https://submissoes.agilebrazil.com/users/2927-nataliamanha","username":"nataliamanha","name":"Natalia Manha","gravatar_url":"https://gravatar.com/avatar/1db13f2d08775d7a6005c775253662c7.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento sobre o método OKRs","tags":["Cultura","Fracasso","Metas","Grandes Empresas","Gestão","Mindset","Pessoas","Sucesso"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"No final de 2017 decidimos começar o uso de OKRs (Objectives and Key Results) no PagSeguro como ferramenta de alinhamento organizacional entre os níveis estratégico e tático. Desde então encontramos diversos desafios, desde a definição desses objetivos e resultados chaves no nosso próprio time de Governança de Portfólio e Agile Coaches até o aprendizado da facilitação dessa prática com diretores, áreas de negócio, cerca de 150 times e um IPO (abertura de capital) no meio do caminho. Depois de um ano desse exercício, nosso objetivo é compartilhar erros, aprendizados e a nossa decisão de continuar o trabalho com OKRs em 2019.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T18:00:43-03:00"},{"id":2639,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2639-superando-os-desafios-da-hierarquia-na-transformacao-agil-de-um-centro-de-computacao-da-aeronautica","title":"Superando os desafios da hierarquia na Transformação Ágil de um Centro de Computação da Aeronáutica","authors":[{"user_id":3367,"user_uri":"https://submissoes.agilebrazil.com/users/3367-fernandordesa","username":"fernandordesa","name":"Fernando Rodrigues de Sá","gravatar_url":"https://gravatar.com/avatar/e3a96feebeb03f1332ef12f1e402c094.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":399,"user_uri":"https://submissoes.agilebrazil.com/users/399-evtlucas","username":"evtlucas","name":"Everton Luiz de Resende Lucas","gravatar_url":"https://gravatar.com/avatar/f62ee5c073049dc5a6c097894cd3fe8a.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento básico de Métodos Ágeis","tags":["Cultura","Governo","Scrum","Transformação"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"Nesta apresentação vamos falar sobre como estamos trabalhando a Transformação Ágil no Centro de Computação Aeronáutica de São José dos Campos (CCA-SJ), uma organização militar da Força Aérea Brasileira.\r\n\r\nInicialmente, apresentaremos os problemas que nos motivaram a criar um Escritório de Gerenciamento de Projetos (EGP), com o objetivo inicial de implantar Métodos Ágeis.\r\n\r\nEm seguida, apresentaremos os desafios da Transformação em uma Organização fortemente baseada na hierarquia.\r\n\r\nApresentaremos também as abordagens utilizadas pelo EGP para atingir todos os níveis da Organização.\r\n\r\nPor fim, apresentaremos dois casos de sucesso e como eles podem influenciar outros Times, facilitando a jornada dos Agentes de Mudança.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T18:03:03-03:00"},{"id":2641,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2641-coracoes-da-lila-usando-jogos-para-ampliar-horizontes","title":"Corações da Lila: Usando jogos para ampliar horizontes","authors":[{"user_id":2378,"user_uri":"https://submissoes.agilebrazil.com/users/2378-anah","username":"anah","name":"Ana Carolina Hermann","gravatar_url":"https://gravatar.com/avatar/9b3cc875e6f85b9618df7626c7aa750b.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Nenhum","tags":["Cultura","Design","Inovação","Aprendizagem","Pessoas"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":30,"summary":"Temos cada vez mais os desafios de formar equipes inclusivas e melhorar a acessibilidade dos nossos sistemas. Porém não basta apenas a boa vontade: é preciso ensinar as pessoas a pensarem de outra forma no seu dia-a-dia e a aplicarem essa nova perspectiva em suas ações. Nos jogos de tabuleiro encontramos uma ferramenta útil para o processo de inclusão e uma forma lúdica de trabalhar a acessibilidade. Nosso caminho iniciou com a integração de pessoas, passou pelo descoberta do que software tem em comum com jogos de tabuleiro, e culminou com a criação do Corações da Lila, um jogo para facilitar a inclusão de PCDs (pessoas com deficiência) no ambiente de trabalho.","mechanics":"Os participantes serão divididos em grupos de até 6 pessoas. Os kits de jogo serão fornecidos por nós e sorteados para os participantes ao final. São necessárias mesas para colocar as cartas. \r\n\r\n!https://bddwarriors.files.wordpress.com/2018/06/coracoesintegracao_.jpg?w=300\u0026h=225!\r\n!https://bddwarriors.files.wordpress.com/2018/06/35264919_492977484450236_7299375066481950720_o.jpg?w=300\u0026h=225!\r\n\r\nAs regras principais são:\r\n \r\nPara decidir quem inicia o jogo são usadas questões como \"Quem começou a usar óculos primeiro\". Assim os jogadores já começam a refletir sobre o impacto do tema na prática.\r\n \r\nNa sua vez o jogador pode: ou pegar corações, ou comprar uma carta usando os corações, ou comprar um objetivo usando os corações. \r\n\r\nCartas e Objetivos dão os pontos necessários para ganhar a partida. As cartas são divididas em categorias e tipos. \r\n\r\nTipos de cartas: Definição, Informação, Pessoa, Filme e Ação. O tipo é dado pelo título da carta. Cartas de Ação valem mais pontos, pois ações valem mais do que palavras.\r\n \r\nCategorias de cartas (até o momento): Deficiência Visual, Auditiva, Intelectual, Física, Transtorno do Espectro Autista (TEA) e Genérica. A categoria é dada pelo texto da carta.\r\n\r\n!https://bddwarriors.files.wordpress.com/2018/08/cardwithcaptions.jpg!\r\n  \r\nObjetivos, assim como as cartas de início, também apresentam pequenos cenários para levar à reflexão e dão pontos extras se o jogador conseguir determinadas cartas, como \"Um funcionário passou a usar cadeira de rodas - Ganhe 3 pontos ao final da partida se você tiver a maior quantidade de cartas de Deficiência Física\". \r\n   \r\nO final da partida ocorre quando alguém somar 8 pontos nas cartas. Então joga quem ainda falta para concluir a rodada e são contados os pontos das cartas e dos objetivos para determinar quem ganhou.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T18:17:58-03:00"},{"id":2643,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2643-compilar-nao-basta-escreva-codigo-para-pessoas-e-nao-apenas-para-maquinas","title":"Compilar não basta: Escreva código para pessoas e não apenas para máquinas","authors":[{"user_id":3383,"user_uri":"https://submissoes.agilebrazil.com/users/3383-edlainezamora","username":"edlainezamora","name":"Edlaine Zamora","gravatar_url":"https://gravatar.com/avatar/6da43489e5a205df47ce44900019808b.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":1385,"user_uri":"https://submissoes.agilebrazil.com/users/1385-ccrispim","username":"ccrispim","name":"Camilla Crispim","gravatar_url":"https://gravatar.com/avatar/8cb602e5adfbf39ce26df75c6a358edd.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Devem ser pessoas que têm contato com código, pois vamos focar em práticas ágeis para escrever um código com qualidade e fácil de evoluir e manter.","tags":["Arquitetura","Código","Design","Padrões","Práticas","Princípios e valores","Qualidade","Refatoração","Extreme Programming"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":null,"summary":"Escrever código que uma máquina entenda é fácil, qualquer pessoa que sabe um pouco de programação consegue. O desafio é escrever código que qualquer uma entenda e altere facilmente, sem introdução de defeitos. Você já leu um trecho de código e pensou \"O que diabos isso está fazendo?\" ou \"Como vou alterar isso para atender às novas necessidades?\", \"E se quebrar tudo?\". Como a pressão e a correria do dia-a-dia que a maioria de nós vive pode contribuir para isso? Nesta palestra, vamos apresentar uma série de dicas para que você possa não só escrever código legível, mas identificar melhorias no código, além de mostrar como práticas do eXtreme Programming são fundamentais – de ritmo sustentável à criação de código de qualidade, permitindo a todo o time de desenvolvimento mudar com confiança.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T18:26:56-03:00"},{"id":2654,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2654-o-paralelepipedo-de-testes-quebrando-a-piramide-de-testes-propositalmente","title":"O paralelepípedo de testes: Quebrando a pirâmide de testes propositalmente","authors":[{"user_id":2,"user_uri":"https://submissoes.agilebrazil.com/users/2-hugo-corbucci","username":"hugo.corbucci","name":"Hugo Corbucci","gravatar_url":"https://gravatar.com/avatar/44ee3f196b3787b6ac3aa3ca9dd88784.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Entendimento de injeção de dependência, teoria da pirâmide de teste e padrões de projeto","tags":["Código","Padrões","Práticas","Qualidade","Refatoração"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Profundo (Pré requisitos são obrigatórios, e devem ser específicos)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":null,"summary":"Nessa sessão, vou apresentar a forma que nosso time da DigitalOcean tem escrito testes que vai contra a ideia da pirâmide de testes e nos permite atingir um alta cobertura de testes com diferentes níveis de integração em diferentes ambientes sem precisar escrever de testes em vários níveis.\r\n\r\nVocê verá exemplos de código sobre como os testes (e o sistema) são estruturados e como eles são executados de maneira diferente dependendo do ambiente. Mostrarei como os mesmos testes acabam servido tanto como testes de unidade, de integração, de API e de \"fumaça\" (smoke tests) entre outros.\r\n\r\nSe você está cansado de re-escrever testes semelhantes em vários níveis, essa sessão é para você.\r\nOs códigos serão em Go(lang) mas a ideias valem para qualquer linguagem.","mechanics":"Pretendo começar com um pequeno projeto com um CRUD simples e alguns testes de unidade e testes de integração tradicionais e refatorar o projeto aos poucos durante a apresentação para apresentar os conceitos e suas dificuldades ou vantagens.\r\nO código estará em golang e os passos já todos codificados para que eu não perca tempo digitando durante a apresentação. Apenas passarei pelas versões pré-preparadas do repositório.\r\n\r\nEu pretendo passar pelo código e suas mudanças e rodar os testes em todos os possíveis ambientes em 35 minutos e deixar 15 minutos para perguntas e discussões sobre as desvantagens e vantagens desse estilo de teste.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T19:32:40-03:00"},{"id":2660,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2660-voce-esta-evoluindo-seu-produto-de-forma-agil","title":"Você está evoluindo seu produto de forma ágil?","authors":[{"user_id":3388,"user_uri":"https://submissoes.agilebrazil.com/users/3388-maryprovinciatto","username":"maryprovinciatto","name":"Mary Provinciatto","gravatar_url":"https://gravatar.com/avatar/393dcc6c49e85d12245ab4ff4f074873.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Não é necessário ter nenhum conhecimento prévio sobre o assunto.","tags":["Análise de negócio","Negócios","Cultura","Design","Gestão","Mindset","Planejamento","Portfólio","Processo","Produto","Projeto","Riscos","Estratégia","Transformação"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"A maior parte das médias e grandes empresas aplicam métodos ágeis somente no time de desenvolvimento, ou seja, em uma pequena etapa de todo o processo de desenvolvimento ou evolução de um produto. Trabalhar dessa forma pode gerar processos ineficientes e resultar em diversos problemas. Nessa palestra, vamos entender quais são esses problemas e suas causas, buscando gerar insights para solucioná-los.","mechanics":"Apresentação com slides, contextualização e compartilhamento de algumas situações dentro de times.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T19:40:56-03:00"},{"id":2663,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2663-business-owner-o-papel-mais-critico-na-agilidade-de-negocio","title":"Business Owner: O Papel mais Crítico na Agilidade de Negócio","authors":[{"user_id":58,"user_uri":"https://submissoes.agilebrazil.com/users/58-parzianello","username":"parzianello","name":"Luiz Claudio Parzianello","gravatar_url":"https://gravatar.com/avatar/c4cc37ba6d8233170f0245e3c113f99d.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Experiência na implantação de uma cultura ágil em ambientes de negócio","tags":["Análise de negócio","Negócios","Liderança","Gestão","Papéis e Responsabilidades"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Profundo (Pré requisitos são obrigatórios, e devem ser específicos)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"Business Agility é a nova palavra de ordem quando se fala de transformação ágil na perspectiva de negócios. Vemos muita gente tratando do assunto de uma forma simplista, tentando levar processos e ferramentas ágeis para outras áreas não tecnológicas da empresa e um grupo acreditando que abordar agilidade em escala é suficiente para a conquista da agilidade de negócio. Nesta palestra, vamos mostrar como a agilidade evoluiu do nível operacional de processos e ferramentas (Agile Coaches e Team Members) para o tático de produtos e serviços (Product Managers e Owners), demandando a próxima evolução para o nível estratégico, onde o Business Owner se torna o papel mais crítico na transformação ágil do negócio.","mechanics":"Basicamente, vou executar esta palestra misturando apresentação (conceitos, modelos e exemplos - implementação real) com um debate feito com a audiência. Tópicos da apresentação:\r\n\r\n1. A perspectiva de negócios e os novos gargalos das transformações ágeis (5min)\r\n2. Business Agility e os novos desafios da Cultura, Gestão e Liderança (10min)\r\n3. Business Owner: responsabilidades, autoridades e competências (15min)\r\n4. Estudo de caso: Os benefícios do papel de BO numa iniciativa de transformação digital (grande grupo de varejo) (5min)\r\n5. Debates com a audiência (15min)","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T19:57:01-03:00"},{"id":2668,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2668-beyond-budgeting-lideranca-e-cultura-ageis-para-viver-sem-orcamento","title":"Beyond Budgeting: liderança e cultura ágeis para viver sem orçamento","authors":[{"user_id":3298,"user_uri":"https://submissoes.agilebrazil.com/users/3298-raoni","username":"raoni","name":"Raoni Resende","gravatar_url":"https://gravatar.com/avatar/c9a6cd98e3dd0626a27c442ea1d19ebd.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento básico de ferramentas ágeis e atuação em iniciativas de grandes empresas","tags":["Autonomia","Fora da TI","Negócios","Cultura","Grandes Empresas","Liderança","Gestão","Mindset","Pessoas","Princípios e valores","Auto-organização","Estratégia","Transformação"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"A grande maioria das organizações ainda trabalha de maneira tradicional do ponto de vista financeiro, com um orçamento rígido influenciando diretamente sua atuação e operação, impactando sua agilidade. O Beyond Budgeting surgiu como alternativa a esse modelo com princípios muito alinhados aos do Manifesto Ágil. Muito além do comando e controle, focado em empoderamento e adaptação, busca dar às pessoas autonomia e informação para a tomada de decisão. O movimento nasceu na área financeira, mas a transcendeu, tornando-se uma ferramenta de transformação das empresas e convergindo com o ágil. Vou apresentar como ele traz muito mais agilidade para os negócios, com casos reais de aplicação e seus benefícios, fazendo diversas provocações sobre os modelos vigentes na maioria das empresas.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T21:03:20-03:00"},{"id":2679,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2679-yes-we-kanban-jornada-kaizen-no-case-de-um-grande-banco-americano","title":"Yes, we Kanban: jornada kaizen no case de um grande banco americano","authors":[{"user_id":3394,"user_uri":"https://submissoes.agilebrazil.com/users/3394-joao-grabosque","username":"joao.grabosque","name":"João Paulo Grabosque","gravatar_url":"https://gravatar.com/avatar/99898f984ab3ea057cbc5e84f9d0b440.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Mínimo de conhecimento sobre times ágeis e Kanban.","tags":["Gestão de Mudanças","Melhoria","Kanban","Aprendizagem","Gestão","Método","Métricas","Práticas","Processo","Sucesso","Transformação","Visualização"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"Um time grande (40 pessoas), distribuído, recém formado e com uma missão ousada: garantir o sucesso de um cliente! \r\nO cliente, um grande banco americano, tradicional, burocrático, extremamente crítico e exigente. \r\nO cenário atual parecia caótico: estrutura nova, muitos produtos, conhecimento centralizado, pessoas sobrecarregadas, prazos agressivos, falta de visibilidade e um grande desafio pela frente...\r\nNo início de 2017 esse era o cenário. De lá pra cá muita coisa mudou, aprendemos, evoluímos e queremos compartilhar toda essa jornada.\r\nVamos apresentar como o Kanban nos ajudou nesse processo de evolução, mostrando como suas práticas nos ajudaram a evidenciar nossos problemas, identificar as oportunidades de melhorias e construirmos um ambiente mais ágil e melhores resultados.","mechanics":"Apresentação expositiva utilizando slides.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T21:50:22-03:00"},{"id":2686,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2686-agile-planning-board-transparencia-para-estimativas-e-planejamento-de-projetos","title":"Agile Planning Board - Transparência para estimativas e planejamento de projetos.","authors":[{"user_id":1095,"user_uri":"https://submissoes.agilebrazil.com/users/1095-edson","username":"edson","name":"Edson Sousa","gravatar_url":"https://gravatar.com/avatar/b413d6330ee5bc19a34fbf3b473b3ec4.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Atuação em times ágeis","tags":["Estimativa","Metas","Métricas","Planejamento","Riscos","Scrum","Times","Visualização"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":null,"summary":"Estimar não é uma atividade fácil.\r\n\r\nO alinhamento das expectativas entre todos os envolvidos, discussões sobre as incertezas de negócio e técnicas são fatores fundamentais para diminuir os riscos do planejamento.\r\n\r\nO #AGILEPLANNINGBOARD é um canvas criado para auxiliar equipes de projetos a realizar planejamentos de releases e de sprints com transparência e agilidade.\r\n\r\nVenha entender como utilizar e ter dicas de resolução de conflitos através de cases reais. Aprenda técnicas para negociar o escopo e estimar o esforço para os seus objetivos, com sucesso comprovado em diversos times e empresas.\r\n\r\nSe você possui dúvidas sobre planejamentos e estimativas, está convidado para participar, discutir e aplicar o #AGILEPLANNINGBOARD em seu projeto no dia seguinte.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T22:10:32-03:00"},{"id":2691,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2691-aprenda-a-construir-uma-dev-cli-do-zero","title":"Aprenda a construir uma dev-cli do zero","authors":[{"user_id":1385,"user_uri":"https://submissoes.agilebrazil.com/users/1385-ccrispim","username":"ccrispim","name":"Camilla Crispim","gravatar_url":"https://gravatar.com/avatar/8cb602e5adfbf39ce26df75c6a358edd.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3075,"user_uri":"https://submissoes.agilebrazil.com/users/3075-gabrieljbl","username":"gabrieljbl","name":"Gabriel Barreto","gravatar_url":"https://gravatar.com/avatar/da5a08152a0df6229d609388fa8d96b4.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Experiência com programação.","tags":["Automação","Código","DevOps","Melhoria","Práticas","Qualidade","Times"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":20,"summary":"No dia-a-dia de um projeto de desenvolvimento de software, temos além da escrita regular de código, muitas outras tarefas como se conectar a uma VPN; atualizar e integrar código; se conectar e fazer consultas em DBs; configurar ambiente de desenvolvimento ou teste; além de investigar problemas. Quando somado, o tempo gasto nessas tarefas é considerável.\r\n\r\nComposta por diversos scripts, a dev-cli é uma interface de comando no terminal que visa facilitar a vida e dar um boost na produtividade das pessoas desenvolvedoras. Essa técnica não é nova, no entanto, poucas pessoas desenvolvedoras conhecem e desfrutam de seus benefícios.\r\n\r\nVamos construir uma dev-cli para um projeto open source juntas, a partir de um bootstrap. Tendo colocado a mão na massa, vai ser mais fácil adotar em seu projeto.","mechanics":"Apresentação teórica para contextualização; contexto sobre o projeto que adicionaremos a dev-cli; setup da dev-cli com uso de bootstrap; contexto sobre o exercício – automação de setup e de check-in dance; instruções do dojo – pareamento alternando entre os dois facilitadores com tela compartilhada no projetor.\r\n\r\n1. Iniciaremos com uma apresentação com contexto sobre dev-cli, quais problemas a técnica pode ajudar a resolver e focaremos nos dois casos de uso que achamos mais importantes: onboarding e check-in de código (20')\r\n2. Mão na massa! (90')\r\n2.1. Introdução ao projeto para o qual faremos uma dev-cli – nova versão do transerviços (5')\r\n2.2. Apresentação dos passos seguintes (3')\r\n2.3. Passos:\r\na) Introdução ao bootstrap de dev-cli – como funciona, comandos e setup. Camilla e Gabriel farão o setup inicial (10')\r\nOBS - É possível que para economizar tempo, tenhamos um projeto já configurado com bootstrap e setup iniciais dos comandos disponíveis e help. Pularemos para esse projeto. Dessa forma, as pessoas se preocupam com o desenvolvimento do core da dev-cli.\r\nb) Chamada de voluntários para parear com um dos facilitadores na construção do core da dev-cli.\r\nc) A cada 5' haverá rotação de pessoas participantes\r\nAo trocar, faremos alinhamento dos próximos passos para garantir a eficácia do pareamento e a não frustração das pessoas participantes.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T22:41:21-03:00"},{"id":2692,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2692-de-projeto-a-produto-dicas-de-quem-transformou-3-projetos-em-1-unico-produto-e-continua-vivo","title":"De Projeto a Produto: Dicas de quem transformou 3 projetos em 1 único produto e continua vivo!","authors":[{"user_id":3403,"user_uri":"https://submissoes.agilebrazil.com/users/3403-robicastilho","username":"robicastilho","name":"Robinson Castilho","gravatar_url":"https://gravatar.com/avatar/3803a921855176dcc5c8bd30bd709ba1.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Experiência com desenvolvimento de Software","tags":["Gestão de Mudanças","Aprendizagem","Gestão","Processo","Produto","Projeto","Auto-organização","Estratégia"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"Parece moleza, mas se um dia seu time tiver que fundir projetos (algo específico, que atende como ninguém um único cliente) em um único produto (algo genérico, que atende personas distintas com características similares mas não idênticas) vocês irão sofrer... e MUITO!\r\nPor isso, quero apresentar tudo que doeu, o quanto machucou, e o caminho das pedras que encontramos durante a jornada. Fizemos essa transformação e temos agora um produto que roda em todas as concessionárias de uma montadora Japonesa que cresce muito no Brasil, uma montadora Alemã do segmento Premium e na maior fabricante de veículos comerciais que existe por aqui.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":false,"created_at":"2019-04-27T22:42:37-03:00"},{"id":2695,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2695-trazendo-de-volta-o-desenvolvimento-de-software-para-o-repertorio-do-agile-coach","title":"Trazendo de volta o desenvolvimento de software para o repertório do Agile Coach","authors":[{"user_id":814,"user_uri":"https://submissoes.agilebrazil.com/users/814-emerson-hernandez","username":"emerson.hernandez","name":"Émerson Hernandez","gravatar_url":"https://gravatar.com/avatar/2bcf0a8bc9ebf6ee8cbc01768f80bcb1.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":936,"user_uri":"https://submissoes.agilebrazil.com/users/936-vcampos","username":"vcampos","name":"Vinicius Campos Silva","gravatar_url":"https://gravatar.com/avatar/4d79af20d7b9a3e4bfff887829e9f623.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Mínimo de conhecimento sobre o ciclo de desenvolvimento de software","tags":["Coaching","Código","Gestão","Práticas"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":null,"summary":"Enquanto Agile Coach e similares nos preocupamos com o ciclo de vida do software entregue pelo time?\r\nComo podemos ter uma atuação além de assuntos de gestão de processo?\r\nComo podemos instigar o uso de práticas de engenharia para trabalharmos contra a entropia de software?\r\n\r\nA premissa da nossa palestra é o conceito de Entropia de Software e seu impacto no desenvolvimento de produtos. Acreditamos que manutenções corretivas e evolutivas como parte do trabalho diário estão sendo ignoradas por Agile Coaches no geral. \r\n\r\nQueremos apresentar esse e outros conceitos e alternativas de resolução, para as pessoas começarem a se preocupar mais com isso do que com post-its e facilitações.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T22:45:50-03:00"},{"id":2701,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2701-risk-storming-como-identificar-e-mitigar-riscos-de-qualidade-de-maneira-agil-e-divertida","title":"Risk Storming: como identificar e mitigar riscos de qualidade de maneira ágil e divertida","authors":[{"user_id":2050,"user_uri":"https://submissoes.agilebrazil.com/users/2050-rcursino","username":"rcursino","name":"Rodrigo Cursino","gravatar_url":"https://gravatar.com/avatar/e9269f41a408d9d81c3b408808b0a592.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3316,"user_uri":"https://submissoes.agilebrazil.com/users/3316-fcm","username":"fcm","name":"Fábio Mello","gravatar_url":"https://gravatar.com/avatar/e5cdc624bb5ab9e4d158b5be95889ca0.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"1) Ter interesse em trabalhar com análise de riscos de qualidade; 2) Ter uma conhecimento básico para leitura do idioma inglês","tags":["Facilitação","Gestão","Método","Mindset","Pessoas","Planejamento","Práticas","Processo","Produto","Qualidade","Requisitos","Riscos"],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":70,"summary":"A gestão de riscos é parte fundamental de qualquer projeto, principalmente nos dias de hoje onde temos um contexto de muitas e rápidas transformações, além da experiência do usuário estar no centro das decisões. Assim, identificar, analisar e mitigar riscos são práticas fundamentais para as equipes ágeis.\r\n\r\nNos últimos 2 anos, realizamos mais de 15 sessões do workshop chamado RiskStorming. Ele foi desenhado para ajudar a identificar e mitigar riscos de forma lúdica, fácil e colaborativa. A prática é apoiada por um baralho de 100 cartas e um tabuleiro que contemplam aspectos, heurísticas e técnicas de qualidade.\r\n\r\nNesta sessão Mão na Massa iremos realizar uma edição do RiskStorming para que possamos aprender como ele funciona e sermos capazes de implementá-lo em seus projetos e empresas.","mechanics":"A seguir, detalhamos cada uma das partes da apresentação.\r\n\r\n*1. Preparação (10 minutos)*\r\nNeste momento haverá a formação das equipes, distribuição dos materiais e atividade de team building.\r\n* Serão até 10 equipes de 6 membros cada\r\n* Distribuiremos 1 baralho do TestSphere, 1 tabuleiro, Post-its e canetas\r\n\r\n!http://qalab.com.br/files/ab/rs-1.png!\r\n\r\n*2. Instruções (5min)*\r\n* Será realizada uma revisão sobre os conceitos relacionados à Gestão de Riscos\r\n* Alinhar os objetivos da sessão\r\n* Falar sobre a dinâmica do workshop, suas etapas e resultados esperados\r\n** Escolhido um produto\r\n** Definido os papéis de cada membro do time\r\n** Distribuído os materiais\r\n\r\n*3. Planejamento (10min)*\r\n* As equipes serão instruídas a se auto-organizarem com base nas informações fornecidas\r\n* Cada equipe deve selecionar um Produto conhecido por todos os membros. \r\n\r\n*4. Execução (60min)*\r\nEsta etapa é subdividida em 3 partes:\r\n* *Escolha de aspectos da qualidade (10min)*\r\n** Os times devem escolher, dentre as cartas azuis, 6 aspectos de qualidades que acreditam ser mais importantes/críticos considerando o produto-alvo\r\n* *Identificação de riscos (20min)*\r\n** Um brainstorming deve ser realizado para identificar os riscos relacionados a cada aspectos de qualidade\r\n** Cada risco deve ser documentado em um post-it\r\n** Os mesmos devem ser posicionados próximos aos aspectos de qualidade\r\n* *Seleção de técnicas e heurísticas de qualidade (30min)*\r\n** Os times devem ler as cartas verdes e rosas que falam, respectivamente, sobre técnicas e heurísticas de testes\r\n** A ideia é que o time escolha as cartas que ajudam a mitigar os riscos identificados na etapa anterior\r\n** Estas técnicas e heurísticas irão ajudam na definição de uma estratégia de testes para mitigar os riscos\r\n\r\n*5. Avaliação dos resultados (20min)*\r\nUm representante de cada time irá apresentar os resultados encontrados. Este momento é muito rico, pois haverá o compartilhamento das estratégias utilizadas, os principais riscos identificados e quais técnicas e heurísticas foram selecionadas para mitigá-los.\r\n\r\n*6. Fechamento (5min)*\r\nÉ o momento para agradecer e confraternizar.\r\n\r\nA seguir temos algumas fotos de sessões de Risk Storming executadas em projetos do CESAR e meetups da comunidade de testes Ministry of Testing Recife.\r\n\r\n!http://qalab.com.br/files/ab/rs-2.jpg!","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T23:02:44-03:00"},{"id":2713,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2713-aceleradoras-agil-e-inclusiva-melhorando-a-aprendizagem-e-a-inclusao-na-tecnologia-atraves-do-agil","title":"Aceleradoras ágil e inclusiva: Melhorando a aprendizagem e a inclusão na tecnologia através do ágil","authors":[{"user_id":776,"user_uri":"https://submissoes.agilebrazil.com/users/776-rafapri","username":"rafapri","name":"Rafael Prikladnicki","gravatar_url":"https://gravatar.com/avatar/4aba667288ed07a3e3649bd385f0d128.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3089,"user_uri":"https://submissoes.agilebrazil.com/users/3089-inajaraleppa","username":"inajaraleppa","name":"Inajara Leppa","gravatar_url":"https://gravatar.com/avatar/272b9265412fa0f1c4514ee5c5f4e01f.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento sobre conceitos de metodologias ágeis é desejável","tags":[],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"As Aceleradoras ágil e inclusiva são programas educacionais sem fins lucrativos através de uma parceria universidade-empresa, em que buscamos mais diversidade e inclusão para ambientes de tecnologia em contexto de agilidade. Nesta apresentação vamos explicar a evolução, estágio atual e os resultados dos programas. Compartilharemos alguns aprendizados para quem estiver em busca de conselhos práticos sobre como cultivar ambientes mais inclusivos no contexto ágil.\r\nO programa hoje em dia impacta em torno 24 alunos por semestre. Através do desenvolvimento de um espaço seguro para cometer erros, os participantes aprendem na prática como é estar em um projeto ágil e diverso, visando estarem prontos para buscar oportunidades no mercado de trabalho e também a respeitar e lidar com as diferenças.","mechanics":"Agenda de apresentação (mais provável)\r\n\r\nO problema: falta de diversidade de gêneros na tecnologia. O desafio dos socialmente desfavorecidos. A distância de um sistema educacional adequado para o século XXI. (10 minutos)\r\n- Breve introdução ao tema através de três histórias estudantis diferentes.\r\n- Um exercício de pesquisa para encontrar o problema mais desafiador para o público.\r\n\r\nA aceleradora ágil: como o programa evoluiu. Lidando com a falta de eficácia dos métodos tradicionais. (10 minutos)\r\n- Uma jornada fotográfica sobre a evolução da aceleradora ágil.\r\n- Uma abordagem narrativa usando histórias reais.\r\n\r\nResolvendo o hiato da diversidade: alcançando a distribuição de 50/50 de gênero. (5 minutos)\r\n- Uma explicação da evolução do hiato de diversidade de gênero e suas correlações.\r\n\r\nA aceleradora inclusiva: abrindo as portas para os socialmente desfavorecidos. (25 minutos)\r\n- Exercício de construção de pessoal em grupos de 5: crie uma persona a partir de um conjunto predefinido de características. Nenhum material especial, nem a configuração da sala é necessária. (10 minutos).\r\n- Estando no lugar do aluno, passe pelas sessões do programa.\r\n- Estágio atual, resultado e desafios. (5 minutos)\r\n\r\nQ \u0026 A (15 minutos)\r\n- Forme trios, peça a cada pessoa para fazer uma pergunta a cada um e instrua o trio a selecionar a melhor pergunta a ser feita.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-27T23:55:13-03:00"},{"id":2717,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2717-modern-agile-no-nubank-e-o-futuro-do-desenvolvimento-de-software","title":"Modern Agile no Nubank e o futuro do desenvolvimento de software","authors":[{"user_id":253,"user_uri":"https://submissoes.agilebrazil.com/users/253-alex","username":"alex","name":"Alexandre Freire Kawakami","gravatar_url":"https://gravatar.com/avatar/54b9a028e87738853c0936a0fcc515e7.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"ter participado de uma equipe que entrega software","tags":["Cultura","Feedback","Inovação","Gestão","Management 3.0","Padrões","Pessoas","Planejamento","Práticas","Princípios e valores","Processo","Auto-organização","Startup","Estratégia","Sucesso","Times","Extreme Programming"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":null,"summary":"\"Ágil\" se tornou mainstream. Basta instalar o Jira e ter uma \"daily\" pra fazer Scrum... mas desencana das retrospectivas. Basta instalar o Jenkins que \"fazemos CI\", não importa que o código está parado numa PR num feature branch já fazem semanas. Basta instalar o Kubernets que temos DevOps, nem pensa em falar que os sysadmins deveriam codar e os devs responder à incidentes de produção. Nossa indústria novamente demonstra como é capaz de pegar qualquer inovação e co-optar em mais do mesmo. Venha ver como estamos aplicando os princípios de Modern Agile no Nubank para nos mantermos ágeis e evoluirmos nossa prática muito além de qualquer framework padrão.","mechanics":"palestra com participação do público","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-04-28T10:44:04-03:00"},{"id":2742,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2742-dockerizando-aplicacoes-em-uma-fintech-o-bom-o-mau-e-o-feio-as-surpresas","title":"Dockerizando aplicações em uma Fintech: O bom, o mau e o feio/as surpresas","authors":[{"user_id":1910,"user_uri":"https://submissoes.agilebrazil.com/users/1910-gomex","username":"gomex","name":"Rafael Gomes","gravatar_url":"https://gravatar.com/avatar/81f83e1cf3a5c0fd5b59ae066f64e3c0.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento básico em virtualização de aplicações","tags":["Automação","DevOps","Feedback","Projeto","Startup"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"Nessa apresentação falarei de todos os problemas e facilidades que tivemos na adoção do Docker como virtualização de aplicações, tanto no processo de desenvolvimento da aplicação, utilizando pacotes específicos, como em produção com uma máquina mais enxuta seguindo o 12factor apps em um ambiente critico do ponto de vista de disponibilidade.","mechanics":"Demonstrarei inicialmente o método utilizado para escolha das prioridades e entrega rápida de valor.\r\n\r\nDeixarei claro que a área de Infra funciona hoje como cascata e apresento caminhos como mudar esse panorama. \r\n\r\nCom base em ume exemplo prático, demonstro o que fiz para mudar esse cenário.\r\n\r\nDemonstro o problema enfrentado no meu projeto, detalhado em fases de entrega:\r\n\r\n- Entrega de ambiente para desenvolvimento\r\n- Construção do CI\r\n- Automatização dos testes\r\n- Automatização de analise de código (Sonar)\r\n- Criação do artefato\r\n- Aplicação de tags no artefato\r\n- Deploy do artefato em QA\r\n- Testes end-to-end\r\n- Aplicação de tags no artefato\r\n- Deploy do artefato em Produção\r\n\r\nEm cada fase demonstrarei todos os problemas enfrentados, os caminhos, assim como os pontos que decidimos simplesmente lidar sem intervenção.\r\n\r\nAo final mostrarei que o mais importante é atender a expectativa do cliente, que nesse caso é o desenvolvedor. Que não adianta usar a melhor tecnologia se a pessoa que vai usar não está envolvida no processo.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-02T08:18:59-03:00"},{"id":2745,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2745-agile-pair-mob-programming-healthcare-ethics-research-burnout-frameworks","title":"Agile=[(Pair+Mob Programming+Healthcare+Ethics)*Research] / (burnout-frameworks)","authors":[{"user_id":1259,"user_uri":"https://submissoes.agilebrazil.com/users/1259-herez","username":"herez","name":"Herez Moise Kattan","gravatar_url":"https://gravatar.com/avatar/ad9d0dfcc7cd7656817228c5bc79fda5.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Experiência \u003e= 5 anos com ágil","tags":["Futuro"],"duration_mins":50,"session_type":"Debate","audience_level":"Profundo (Pré requisitos são obrigatórios, e devem ser específicos)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":9999,"summary":"Continuaremos criando software e resolvendo problemas. A saúde dos desenvolvedores/inovadores será uma parte fundamental do mercado de trabalho. Assim como a aceitação à mudança e um comportamento ético. As organizações deveriam exigir ou contribuir com evidências científicas dos Arcabouços Processuais antes de usá-los. Reduzindo-os aos validados cientificamente e estatisticamente significativos, aprimorando-os. ASAP anseio por métodos de pesquisa para engenharia de software mais consistentes e bancos de dados integrados entre ACM, IEEE-CS, SBC e Agile Alliance. Citarei o meu mestrado sobre Programação e Revisão Simultânea em Pares e agora o doutorado sobre Mob Programming, reduz o estresse, tornando o trabalho mais divertido em alguns casos. Então, pode reduzir a possibilidade de burnout.","mechanics":"* Apresentação inicial com Slides de 20 minutos:\r\n** 00-02 min: Indrodução \r\n** 02-05 min: Reutilização de conhecimento fora da comunidade Ágil\r\n** 05-10 min: Métodos de Pesquisa em Engenharia de Software\r\n** 10-20 min: Apresentação sobre a minha visão de AgileFuture = [(Pair + Mob Programming) + (HealthCare * Ethics * Research) - (burnout / frameworks)]\r\n* Fishbowl tradicional com duração de 30 minutos, pode ser com 5 cadeiras no palco, mas dependerá do tamanho do palco e do número de participantes:\r\n** 20-22 min: Colaborativamente decidiremos as perguntas, vou sugerir perguntas tanto focadas na minha preferência por uma cultura de engenharia, quanto aspectos gerenciais sem falar de engenharia de software ou defender Frameworks caso alguém queira debater isso.\r\n** 22-27 min: Início do debate sobre a apresentação compartilhando as suas opiniões, argumentos ou experiências cobaborativamnte eu vou mediando fornecendo umas perguntas para debater se for o caso, para não deixar o debate esfriar.\r\n** 27-50 min: Debate e eu vou mediando e colaborativamente vamos avançando para próximas questões a serem debatidas no Fishbowl.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-02T15:35:26-03:00"},{"id":2750,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2750-o-mito-da-agilidade-bom-rapido-e-barato","title":"O mito da agilidade: bom, rápido e barato.","authors":[{"user_id":1723,"user_uri":"https://submissoes.agilebrazil.com/users/1723-giuliano","username":"giuliano","name":"Giuliano Sposito","gravatar_url":"https://gravatar.com/avatar/2adfb1930aa9591ea756b0d94ca3603b.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Ter experiência intermediária com scrum e/ou outras práticas ágeis.","tags":["Melhoria","Kanban","Método","Métricas","Práticas","Qualidade","Papéis e Responsabilidades","Scrum","Transformação"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":null,"summary":"Scrum faz o \"dobro pela metade do tempo\"! Será? \r\n\r\nDurante a nossa transformação ágil, aprendemos como itens do framework ágil, que geralmente são subestimados no seu entendimento (Proficiência do PO e tamanho das histórias), são críticas para a qualidade do produto e para a performance do próprio time de desenvolvimento. \r\n\r\nPlannings que não funcionam, sprints que não entregam software e o desenvolvimento do produto errado são sinais de que algo está errado na maneira que seu time está implementando agilidade. Sofremos com o esses problemas e hoje frequentemente os encontramos empresas que estão começando a sua jornada ágil. Nesta palestra mostraremos como utilizamos os conceitos de Ready-Ready, PO Team, Heijunka e Story-Slicing para tirar o máximo do framework ágil.","mechanics":"Apresentação tipo palestra.","status":"Aguardando confirmação","author_agreement":null,"image_agreement":null,"created_at":"2019-05-03T11:27:28-03:00"},{"id":2758,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2758-padroes-de-modelos-de-negocios-para-transformacao-digital","title":"Padrões de Modelos de negócios para transformação digital","authors":[{"user_id":57,"user_uri":"https://submissoes.agilebrazil.com/users/57-felipero","username":"felipero","name":"Felipe Rodrigues de Almeida","gravatar_url":"https://gravatar.com/avatar/2c4ef777314d3ecbba43604b8b2a6745.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Gostar de negócios e estratégia","tags":["Análise de negócio","Negócios","Cultura","Futuro","Hipóteses","Inovação","Gestão","MVP","Padrões","Planejamento","Portfólio","Produto","Startup","Estratégia","Transformação"],"duration_mins":50,"session_type":"Debate","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"Uma boa transformação digital passa por transformar o modelo de negócios. Nesta apresentação vamos especular sobre alguns aspectos aparentes dos modelos de negócios de empresas digitais a fim de encontrar padrões nesses modelos de negócio.","mechanics":"Vou levar alguns casos pre-definidos, apresentar o padrão que é usado no caso e depois realizar um pequeno fishbowl para discutir cada caso. A ideia é apresentar 3 casos pelo menos com os passos descritos abaixo:\r\n\r\n1 - Apresento um caso e um padrão;\r\n2 - Vamos para um fishbowl rápido, de 10 min\r\n3 - Fecho o caso com uma conclusão rápida\r\n4 - Volto para o passo 1, com um novo caso.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-03T18:40:59-03:00"},{"id":2766,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2766-xp-como-aliado-para-conter-a-complexidade-de-um-monolito-de-mais-de-15-anos","title":"XP como aliado para conter a complexidade de um monólito de mais de 15 anos","authors":[{"user_id":747,"user_uri":"https://submissoes.agilebrazil.com/users/747-asilveira","username":"asilveira","name":"Anderson Silveira","gravatar_url":"https://gravatar.com/avatar/b3ce01faf1aedeea2f2116503d345f77.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3466,"user_uri":"https://submissoes.agilebrazil.com/users/3466-lfmrocha88","username":"lfmrocha88","name":"Luís Fernando Martins da Rocha","gravatar_url":"https://gravatar.com/avatar/c9c411696949ede191cc4d2567fe73c7.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Básico de XP","tags":["Arquitetura","Automação","Código","DevOps","Feedback","Melhoria","Aprendizagem","MVP","Práticas","Princípios e valores","Processo","Refatoração","Extreme Programming"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":null,"summary":"Por onde começar a adoção de desenvolvimento ágil em um sistema monólito de mais de 15 anos? De fato as dificuldades são enormes em um contexto de produto como esse, onde a dívida técnica se tornou algo irrevogável, silos de conhecimento acentuado, baixa efetividade na análise de impacto e etc. No entanto com a adoção das práticas ligadas XP contivemos a complexidade e viemos melhorando seu design para uma manutenção saudável e evolução confiável no desenvolvimento, as quais foram cruciais para dar a volta por cima. Nessa palestra iremos mostrar qual foi a estratégia adotada para otimizar o desenvolvimento tendo como foco um feedback rápido e confiança na qualidade das entregas. Como fizemos isso? Recorrendo hard skill do eXtreme Programming. Sim foi possível e vamos te contar como.","mechanics":"Apresentação será feita com slides e serão apresentados alguns indicadores reais do projeto\r\n\r\n1. Será apresentado o contexto do problema \r\n2. As tentativas de se começar de maneira equivocada \r\n3. Reviravolta, quais as estratégias adotadas\r\n4. Resultados, indicadores reais\r\n5. Conclusão e próximos passos","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-04T16:27:49-03:00"},{"id":2767,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2767-nao-existe-fase-de-teste","title":"Não existe FASE de teste","authors":[{"user_id":2010,"user_uri":"https://submissoes.agilebrazil.com/users/2010-joaoclineu","username":"joaoclineu","name":"João Clineu Lima da Silva Junior","gravatar_url":"https://gravatar.com/avatar/1a51e1938e892b270beb43690ea89fe8.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Fundamentos de Teste e muita vontade de entender o que é o Teste Ágil de verdade.","tags":["Automação","Cultura","DevOps","Facilitação","Melhoria","Liderança","Maturidade","Mindset","Pessoas","Práticas","Princípios e valores","Qualidade","Papéis e Responsabilidades","Auto-organização","Estratégia","Times"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":null,"summary":"Existe um mito de que Teste Ágil é um processo, uma metodologia ou até mesmo uma receita de bolo, tanto que existe muitos lugares que diz que faz teste ágil, mas ainda estão esperando uma release chegar na sua frente prontinha para ser testada e muitos bugs serem encontrados. Vamos conversar sobre sobre o que de fato vem a ser o teste ágil, mostrando exemplos práticos e de vivencia ao longo da carreira sobre como aplicar essa cultura de pensamento em qualidade continua.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-04T17:16:53-03:00"},{"id":2769,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2769-o-agile-coach-pode-ser-tecnico","title":"O Agile Coach pode ser técnico?","authors":[{"user_id":1080,"user_uri":"https://submissoes.agilebrazil.com/users/1080-elias-nogueira","username":"elias.nogueira","name":"Elias Nogueira","gravatar_url":"https://gravatar.com/avatar/baaa72bd2671a244ba9211e015f72d28.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":2548,"user_uri":"https://submissoes.agilebrazil.com/users/2548-fusca","username":"fusca","name":"Wagner Fusca Voltz","gravatar_url":"https://gravatar.com/avatar/e26d0367de2bbb06bf3059c981aea719.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Entender de conceitos de Engenharia de Software","tags":["Código","Mindset","Práticas","Princípios e valores","Qualidade","Papéis e Responsabilidades","Transformação","Extreme Programming"],"duration_mins":50,"session_type":"Debate","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":null,"summary":"Um Agile Coach deve ser o agente de mudança na condução de uma Transformação Ágil com atuação no indivíduo, time e organização.\r\n\r\nBaseado no Agile Competency Framework da Lyssa Adkins, a condução deve envolver competências de coaching, teaching, mentoring e facilitações e deve considerar a maestria em transformação, estratégias de negócios e parte técnica. \r\nBaseado na experiência dentro de times ágeis (em organizações distintas) e na participação junto a comunidade ágil brasileira, percebemos que temos valorizado mais processo (professional coaching e facilitação) do que conteúdo (teaching e mentoring) e domínio técnico.\r\n\r\nJuntos, queremos dialogar, com todos os perfis de profissionais, sobre como chegamos a isso e se seria possível uma transformação ágil sem considerar a parte técnica.","mechanics":"Usaremos de comunicação não violenta e inclusiva para que este fishbowl não vire uma guerra de mundos (técnico x não técnicos)\r\n\r\nContextualização do tema (10 a 15min min):\r\n* Agile Competency Framework da Lyssa Adkins \r\n* Subway map do Agile Alliance referenciando quais são as práticas técnicas e não técnicas\r\n* Perguntas iniciais para o fishbowl\r\n\r\nAbertura para fishbowl com 5 cadeiras. Haverá um mediador (Elias ou Wagner) que conduzirão possíveis perguntas, caso haja necessidade de trazer um ponto novo.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-04T18:44:09-03:00"},{"id":2770,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2770-do-agil-clandestino-ao-reconhecimento-da-presidencia-de-uma-gigante-do-agronegocio","title":"Do \"Ágil Clandestino\" ao reconhecimento da presidência de uma gigante do agronegócio.","authors":[{"user_id":3019,"user_uri":"https://submissoes.agilebrazil.com/users/3019-aryadnne","username":"aryadnne","name":"Aryadnne Zanatta","gravatar_url":"https://gravatar.com/avatar/a1e45b453008dc6991ea32f6b3e4a6aa.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Scrum - cerimônias, papeis e responsabilidades.","tags":["Fora da TI","Carreira","Gestão de Mudanças","Coaching","Cultura","Estimativa","Facilitação","Feedback","Metas","Melhoria","Inovação","Kanban","Grandes Empresas","Liderança","Lean","Aprendizagem","Legado","Gestão","Management 3.0","Maturidade","Método","Métricas","Mindset","Princípios e valores","Processo","Projeto","Papéis e Responsabilidades","Escala","Scrum","Auto-organização","Estratégia","Transformação"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"Como comprovar o valor das práticas ágeis aos gerentes de uma grande empresa? Qual estratégia usar para implementar os métodos ágeis sem impactar o andamento do desenvolvimento da features e negócio? Por fim,  como conquistar clientes que não acreditam mais no departamento de tecnologia?\r\n\r\nNesta palestra mostrarei a estratégia usada, combinando design sprint, scrum e kanban para comprovar em 6 meses o valor das práticas ágeis que conquistou a confiança e investimento financeiro do presidente de uma gigante do agronegócio brasileiro.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-04T21:13:02-03:00"},{"id":2771,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2771-qualidade-de-software-alem-dos-testes-conheca-os-quality-gates","title":"Qualidade de software além dos testes: Conheça os quality gates!","authors":[{"user_id":3167,"user_uri":"https://submissoes.agilebrazil.com/users/3167-fabiopio","username":"fabiopio","name":"Fábio Pio","gravatar_url":"https://gravatar.com/avatar/b93703f5efef14bc474cf04e03799683.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento do manifesto ágil, bem como interesse em aprender como aplicar práticas ágeis de forma efetiva","tags":[],"duration_mins":50,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"Não é somente através do código que é possível se obter um produto de qualidade. Existem várias práticas ágeis que se corretamente aplicadas, contribuem para que times de desenvolvimento retomem os verdadeiros valores de uma entrega ágil de qualidade.\r\n\r\nNesta sessão irei compartilhar minha experiência com algumas destas práticas também conhecidas como \"quality gates\", que permeiam desde o entendimento de negócio à concepção e entrega de um produto. Entenderemos como pessoas interessadas na qualidade em projetos podem aplicar tais práticas que além de garantir que estamos a desenvolver o produto certo, estamos também desenvolvendo o produto da forma correta.","mechanics":"Apresentação de slides, com a seguinte estrutura:\r\n\r\nIntro (10 minutos)  -  Contextualização sobre a adoção das práticas ágeis e modelos de desenvolvimento de software. Irei expor exemplos de como geralmente times ágeis se organizam com relação ao Kanban e o ciclo de vida de uma estória num processo ágil.\r\n\r\nDesenvolvimento (30 min) - Apresentação dos conceitos e práticas, exposição de exemplos reais com relação ao valor da aplicação de tais práticas.\r\n\r\nFinalização (10 min) - Abertura para perguntas, momento de compartilhamento de experiências e discussão do grupo a cerca do conteúdo exposto.","status":"Aguardando confirmação","author_agreement":null,"image_agreement":null,"created_at":"2019-05-04T21:34:31-03:00"},{"id":2778,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2778-statik-do-kanban-na-pratica","title":"STATIK do Kanban na prática","authors":[{"user_id":3288,"user_uri":"https://submissoes.agilebrazil.com/users/3288-jucainelli","username":"jucainelli","name":"Juliana Cainelli","gravatar_url":"https://gravatar.com/avatar/1745052295f45073fdebc6cd9ed440da.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":3455,"user_uri":"https://submissoes.agilebrazil.com/users/3455-vanessa-lacerda","username":"vanessa.lacerda","name":"Vanessa de Campos Lacerda","gravatar_url":"https://gravatar.com/avatar/949a19753d03f3b4b529188d9e4987e9.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"sem pré requisitos","tags":[],"duration_mins":110,"session_type":"Mão na Massa","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":30,"summary":"David Anderson define Systems Thinking Approach to Introduce Kanban (ou STATIK) é, como a principal abordagem para quem deseja adotar o Kanban. A aplicação ocorre  em grupo envolvendo o time e o Product Owner para o qual pretende-se aplicar o método Kanban. \r\nO método STATIK é exploratório, e por isso pode ser utilizado também para melhorar uma implementação Kanban já existente ou até mesmo para a resolução de problemas e tomadas de decisão aproveitando-se do pensamento sistêmico e dos princípios e práticas do Kanban.","mechanics":"Realizada uma dinâmica de energização para o grupo crioar sinergia\r\nSerá abordado concentos básicos do Kanban e do Statik \r\nUm cenário hipotético é apresentado e com base neste cenários iniciaremos a dinâmica como em um STATIK real passando por todos os passos:\r\n\r\n•Definição do  Propósito: \r\nInsatisfações\r\nAnálise da demanda\r\nAnálise da capacidade\r\nWorkflow: Conhecimento ao longo do tempo\r\n Classes de Serviço\r\nKanban System Design – Modelando o sistema\r\nColocar o sistema Kanban pra rodar!\r\n\r\nO time box será definido por atividade \r\nPara aplicação precisamos de uma sala com paredes, post its, pois o Workshop é visual,","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-05T00:10:11-03:00"},{"id":2781,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2781-a-utilizacao-de-metodologias-ageis-na-agencia-experimental-de-engenharia-de-software-da-pucrs","title":"A Utilização de Metodologias Ágeis na Agência Experimental de Engenharia de Software da PUCRS","authors":[{"user_id":3449,"user_uri":"https://submissoes.agilebrazil.com/users/3449-alessandradutra","username":"alessandradutra","name":"Alessandra C. S. Dutra","gravatar_url":"https://gravatar.com/avatar/50cf65bdbc9e28c17adabf489e1e07e4.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento sobre conceitos de metodologias ágeis é desejável","tags":["Kanban","Aprendizagem","Práticas","Projeto","Scrum","Auto-organização","Times"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Inicial / Superficial (Pré-requisitos são opcionais)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"A AGES - Agência Experimental de Engenharia de Software é um ambiente de aprendizado voltado ao desenvolvimento de projetos de software, vinculado ao curso de Engenharia de Software da PUCRS. A AGES tem como objetivo propiciar aos alunos a vivência de situações reais de projetos em um ambiente com foco na aprendizagem, permitir contato com organizações e empresas, e construir com o aluno o seu portfólio de projetos. Para o desenvolvimento do projeto são utilizadas práticas de metodologias ágeis, onde o time aprende a se auto-organizar para fazer as entregas do projeto. Já foram executados mais de 30 projetos, e nesta palestra estaremos contando um pouco desse relato de experiência.","mechanics":"Introdução : ( 5 minutos)\r\nO que é a AGES, objetivos. \r\n\r\nProjetos:  ( 5 minutos)\r\nApresentação dos projetos, clientes, tamanho dos projetos e seus tópicos \r\n\r\nMetodologias do trabalho:  \r\nIniciação com o modelo ágil e sua evolução para as metodologias ágeis  (5 minutos)\r\n\r\nDesafio:   (10 minutos)\r\nBusca por novos projetos a cada semestre e a escolha de projetos interessantes.\r\nAtuação dos professores com as metodologias ágeis.\r\nO evolução do processo de desenvolvimento de software.\r\nAs reuniões dos alunos com os Stakeholders.\r\nA execução dos projetos em um semestre.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-05T05:25:15-03:00"},{"id":2793,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2793-3-aspectos-essenciais-de-uma-transformacao-agil","title":"3 Aspectos Essenciais de uma Transformação Ágil","authors":[{"user_id":661,"user_uri":"https://submissoes.agilebrazil.com/users/661-rfbuzon","username":"rfbuzon","name":"Rafael Buzon","gravatar_url":"https://gravatar.com/avatar/0c8d09eb3d0cc6455c0da9d9aa9d0a08.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimentos básicos de Agilidade; Scrum; Kanban; e Gestão de Projetos","tags":["Gestão de Mudanças","Cultura","Grandes Empresas","Mindset","Transformação"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"\u003cp\u003eMuito se fala da necessidade de se transformar, mas ainda há pouco conteúdo mostrando como fazê-lo. \u003c/p\u003e\r\n\u003cp\u003eAlguns avançam na transformação realizando treinamentos e pilotando um projeto com Scrum. Outros usam Kanban e seguem a linha evolucionária de gestão de mudança. Porém pouco ou nada se fala da necessidade da gestão holística da transformação, desde como começar até a criação de musculatura para evitar que tudo volte ao que era antes. \u003c/p\u003e\r\n\u003cp\u003eNuma apresentação objetiva baseada em exemplos, quero inspirar seus próximos passos na condução de transformações ágeis refletindo 3 aspectos que julgo imprescindíveis à qualquer transformação.\u003c/p\u003e","mechanics":"Reflexão orientada por slides com exemplos da experiência do autor.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-05T14:29:23-03:00"},{"id":2803,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2803-descendo-do-castelo-um-reino-de-mentiras","title":"Descendo do Castelo: um reino de mentiras","authors":[{"user_id":1750,"user_uri":"https://submissoes.agilebrazil.com/users/1750-avelinoferreiragf","username":"avelinoferreiragf","name":"Avelino Ferreira Gomes Filho","gravatar_url":"https://gravatar.com/avatar/73f5f2bf633ded3e04fdbd9b27858b8a.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":302,"user_uri":"https://submissoes.agilebrazil.com/users/302-rtoledo","username":"rtoledo","name":"Rodrigo de Toledo","gravatar_url":"https://gravatar.com/avatar/a261b49848a6eed294f817578e1cb448.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Ter passado ou estar passando por uma transformação ágil","tags":[],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":null,"summary":"Quando estamos fazendo uma transformação ágil, queremos construir e entregar produtos com valor e alta qualidade. Infelizmente, ao longo dos anos, percebemos que a maioria das mudanças envolve apenas os níveis mais altos da empresa (C-Level e gerentes) e funções específicas da organização (Scrum Master, Agile Coach e Product Owners). O time de desenvolvimento segue passivamente as mudanças organizacionais e de negócios.Nesta sessão, falaremos sobre o papel do time de desenvolvimento na transformação ágil. Mostraremos 12 desafios mais comuns que enfrentamos no Time quando vamos para a Agilidade e precisamos construir um produto mais rapidamente, co maior valor e ainda assim aumentar a qualidade do produto.","mechanics":"Palestra divertida com interação com o público","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-05T17:24:51-03:00"},{"id":2804,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2804-priorizacao-e-medicao-de-portfolio-atraves-da-analise-de-ambiente-x-complexidade-x-beneficio","title":"Priorização e medição de portfólio através da análise de ambiente X complexidade X benefício","authors":[{"user_id":1068,"user_uri":"https://submissoes.agilebrazil.com/users/1068-fabiorcruz","username":"fabiorcruz","name":"Fabio Cruz","gravatar_url":"https://gravatar.com/avatar/6621b6b998674904f5e46f73596ca230.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimentos básicos de projetos, portfólio e/ou desenvolvimento de produtos, e/ou envolvimento direto ou indireto com estratégia e priorização de investimento","tags":["Análise de negócio","Negócios","Cultura","Metas","Gestão","Método","Métricas","Planejamento","Portfólio","Processo","Produto","Projeto","Escala","Estratégia"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Produtos e negócios: concepção, design e gestão","audience_limit":null,"summary":"O mundo está mudando cada vez mais rápido, e os resultados e benefícios esperados por projetos e produtos também, o que está levando as empresas a buscarem por mais inovação enquanto sustentam e evoluem seus produtos e serviços atuais que também estão mudando. Como selecionar, priorizar e medir diferentes realizações em ambientes diferentes, com mais ou menos inovação e com mais ou menos previsibilidade? O objetivo desta palestra é apresentar frameworks para tomada de decisão que afetam a forma de gerir, acompanhar e medir portfólios, produtos, projetos e equipes em ambientes ágeis.","mechanics":"Apresentação estilo Palestra/Debate\r\n1 - Introdução ao Cynefin Framework\r\n1.a - Os sistemas: Ordenado, Caótico e Complexo\r\n1.b - Os domínios: Óbvio, Complicado, Complexo e Caótico \r\n\r\n2 - Domínio Óbvio - Sistema Ordenado\r\n2.a - Contextualização e exemplos\r\n2.b - Desafio: Discussão com o Grupo\r\n2.c - Indicadores mais indicados para este domínio \r\n2.d - Perfil da Gestão e de colaboradores neste domínio\r\n2.e - O PMO atuando no domínio óbvio\r\n\r\n3 - Domínio Complicado - Sistema Ordenado \r\n3.a - Contextualização e exemplos \r\n3.b - Desafio: Discussão com o Grupo \r\n3.c - Indicadores mais indicados para este domínio \r\n3.d - Perfil da Gestão e de colaboradores neste domínio \r\n3.e - O PMO atuando no domínio óbvio \r\n\r\n4 - Reflexão sobre erros e dificuldades comuns nos domínios do sistema ordenado \r\n\r\n5 - Domínio Complexo - Sistema Complexo \r\n5.a - Contextualização e exemplos \r\n5.b - Desafio: Discussão com o Grupo \r\n5.c - Indicadores mais indicados para este domínio \r\n5.d - Perfil da Gestão e de colaboradores neste domínio \r\n5.e - O PMO atuando no domínio óbvio \r\n5.f - Reflexão sobre erros e dificuldades comuns no sistema complexo \r\n\r\n6 - Domínio do Caos - Sistema Caótico \r\n6.a - Contextualização e exemplos \r\n6.c - Indicadores mais indicados para este domínio \r\n6.d - Perfil da Gestão e de colaboradores neste domínio \r\n6.e - O PMO atuando no domínio óbvio \r\n6.f - Reflexão sobre erros e dificuldades comuns no sistema caótico \r\n\r\n7 - O PMO como agente de mudança organizacional e impulsionador da agilidade estratégica \r\n7.a - Contextualização do Framework PMO Ágil \r\n7.b - Como um PMO aplica o Framework PMO Ágil para entregar mais benefício a sua organização em ambientes ágeis e com diferentes sistemas e domínios de complexidade \r\n7.c - Como um PMO se torna um agente de mudança organizacional e um aliado da agilidade \r\n7.d - Resumo de ganhos e benefícios de se usar o Framework PMO Ágil aliado ao Cynefin \r\n\r\n8 - Cases reais onde as praticas apresentadas foram realizadas e seus resultados obtidos\r\n\r\n9 - Desafio geral: Discussão Final e espaço para perguntas","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-05T17:39:33-03:00"},{"id":2806,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2806-nunca-confie-em-um-teste-que-nao-quebra","title":"Nunca confie em um teste que não quebra!","authors":[{"user_id":3479,"user_uri":"https://submissoes.agilebrazil.com/users/3479-byivo","username":"byivo","name":"Ivo Roberto Batistela","gravatar_url":"https://gravatar.com/avatar/2e201a2e7f5df67f665a1f833204f456.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecer e praticar testes unitários","tags":["Automação","Código","Práticas","Qualidade","Extreme Programming"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":null,"summary":"Muito pior do que um código sem testes é um código com testes que não testa nada.\r\n\r\nFicou confuso/a? Pense comigo: Os testes estão aí justamente para garantir que código de produção funcione como esperado, logo, se alguma alteração for feita e nenhum teste quebrou, o time está tendo uma falsa segurança na hora de desenvolver.\r\n\r\nNessa talk vamos falar sobre testes unitários e como atingir um bom nível de eficiência. Serão abordadas algumas métricas e quais detalhes devem ser levados em consideração na hora de escrever um bom teste (a.k.a Um teste que quebra).","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-05T17:50:55-03:00"},{"id":2810,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2810-alinhando-o-discovery-com-delivery-com-customer-e-upstream-kanban","title":"Alinhando o Discovery com Delivery com Customer e Upstream Kanban","authors":[{"user_id":2135,"user_uri":"https://submissoes.agilebrazil.com/users/2135-rafaelcaceres","username":"rafaelcaceres","name":"Rafael Caceres","gravatar_url":"https://gravatar.com/avatar/635d2c27bdda404b56a01e0574f07082.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Kanban Básico","tags":[],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":null,"summary":"A descoberta de novas demandas para resolver problemas de negócios é muito mais rápida que sua entrega, criando uma frustração constante nos clientes.\r\n\r\nO Kanban é um processo de melhoria evolutiva para a entrega, mas isso é só uma parte do problema. \r\n\r\nAs demandas de uma organização não são todas iguais. Em algumas existe uma grande incerteza, como no processo de descoberta, em outras existe uma grande certeza, como resolução de bugs críticos.\r\n\r\nÉ preciso pensar em um modelo onde seja possível modelar as demandas e criar um volume suficiente de opções para serem selecionadas para execução.\r\n\r\nNessa apresentação discutiremos o Upstream Kanban como uma ligação entre o processo de Discovery e Delivery no desenvolvimento de produtos.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-05T18:48:23-03:00"},{"id":2822,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2822-5-duvidas-frequentes-ao-iniciar-o-metodo-kanban","title":"5 dúvidas frequentes ao iniciar o método Kanban","authors":[{"user_id":2739,"user_uri":"https://submissoes.agilebrazil.com/users/2739-polegato","username":"polegato","name":"Carlos Eduardo Polegato","gravatar_url":"https://gravatar.com/avatar/684b0edfa608997b461c9aa2675eb246.png?s=48\u0026d=mm","default_locale":"pt-BR"},{"user_id":2946,"user_uri":"https://submissoes.agilebrazil.com/users/2946-fabiotr","username":"fabiotr","name":"Fábio Trierveiler","gravatar_url":"https://gravatar.com/avatar/4cdcc14281e66dc7495d159b25039caa.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"conhecimento mínimos sobre: quadro Kanban, métricas Kanban e dinâmica Kanban","tags":["Estimativa","Melhoria","Kanban","Aprendizagem","Gestão","Maturidade","Método","Métricas","Planejamento","Auto-organização","Times"],"duration_mins":25,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Práticas de trabalho: da ideia à entrega","audience_limit":null,"summary":"Com o bordão: “Comece na próxima semana”, o método Kanban vem ganhando cada vez mais adeptos. Um método simples e não prescritivo que facilita as empresas iniciarem sua jornada evolucionária.\r\n\r\nO objetivo desta palestra é comentar as cinco dúvidas mais frequentes, na vivência dos palestrantes, que as equipes passam neste início. Como trabalhamos com estas cinco dúvidas em busca de resultado e evolução.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-05T21:14:28-03:00"},{"id":2828,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2828-praticas-emergentes-o-verdadeiro-padrao-de-sucesso-das-empresas-ageis","title":"Práticas Emergentes: O verdadeiro padrão de sucesso das empresas ágeis","authors":[{"user_id":39,"user_uri":"https://submissoes.agilebrazil.com/users/39-axmagno","username":"axmagno","name":"Alexandre Magno","gravatar_url":"https://gravatar.com/avatar/2af33dfe574771fdc31748915826b3fa.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecidos básicos sobre agilidade e algum de seus métodos ou frameworks","tags":["Cultura","Fracasso","Aprendizagem","Padrões","Práticas","Escala","Estratégia","Sucesso"],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Relatos de Experiência: sua história sobre agilidade","audience_limit":null,"summary":"O que é realmente uma empresa ágil e como aprender a se tornar uma? Nessa apresentação, será mostrado porque algumas das práticas que mais gostamos têm se mostrado como grandes impedimentos para que algumas empresas e times se tornem verdadeiramente ágeis. Você verá como muitas das famosas empresas ágeis conseguiram superar este desafio, \u2028enxergará alternativas, e será desafiado a pensar em como que você e sua empresa poderão enfrentá-lo.","mechanics":"","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-05T21:52:57-03:00"},{"id":2836,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2836-como-acabar-com-a-cultura-do-heroi","title":"Como acabar com a cultura do herói?","authors":[{"user_id":52,"user_uri":"https://submissoes.agilebrazil.com/users/52-ceci","username":"ceci","name":"Ceci Fernandes","gravatar_url":"https://gravatar.com/avatar/3059d60c7d475f632fb184e0fb698a20.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Reconhecer quando a cultura do herói ataca em suas organizações e ter pelo menos uma história de quando ela deu bem errado no médio/longo prazo.","tags":["Carreira","Pessoas","Princípios e valores","Auto-organização","Times"],"duration_mins":50,"session_type":"Debate","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Culturas de trabalho: pessoas, times e organizações","audience_limit":null,"summary":"A cultura do herói é aquela que premia pessoas que fazem esforços sobrehumanos para alcançar os objetivos traçados: fazem zilhões de horas-extra, pegam o projeto pra sí e abandonam o resto da própria vida para entregar um projeto no prazo, etc.\r\n\r\nSe você entende o porquê desses incentivos serem extremamente nocivos para o médio/longo prazo, vem conversar sobre como acabar com a cultura do herói, que ainda assola nosso mercado.","mechanics":"Introdução de 15 minutos contando 3 histórias pessoais sobre a cultura do herói, daí pretendo abrir a roda com a primeira pergunta:\r\n\r\nh2. Vocês concordam que heroísmo não deveria ser premiado?\r\n\r\nCreio que essa discussão inicial não dure muito, mas que ela possa render insights interessantes.\r\nAo término dessa discussão ou em 15 minutos, o que acontecer primeiro, seguimos para o segundo tópico:\r\n\r\nh2. Como combater a cultura do herói nas organizações?\r\n\r\n-----\r\n\r\nOs pontos principais das conversas serão registrados e expostos na área da conferência após a sessão.","status":"Aceita","author_agreement":true,"image_agreement":true,"created_at":"2019-05-05T23:19:53-03:00"},{"id":2838,"session_uri":"https://submissoes.agilebrazil.com/2019/sessions/2838-infraestrutura-imutavel","title":"Infraestrutura Imutável","authors":[{"user_id":1717,"user_uri":"https://submissoes.agilebrazil.com/users/1717-fike","username":"fike","name":"Fernando Ike","gravatar_url":"https://gravatar.com/avatar/168c322e7157a4cfffdeb88ab2309e02.png?s=48\u0026d=mm","default_locale":"pt-BR"}],"prerequisites":"Conhecimento básico de Infraestrutura, Continuous Delivery e Rede","tags":[],"duration_mins":50,"session_type":"Apresentação","audience_level":"Intermediário (Pré-requisitos são importantes, contudo podem ser mais genéricos)","track":"Mão no código: desenvolvimento de software e tecnologia","audience_limit":null,"summary":"Infraestrutura Imutável é um dos mais fundamentais e importantes conceitos aplicados para ambientes resilientes e de alta disponibilidade. É referência base para orquestração de containers, como também, para qualquer serviço que necessite SLAs cada vez mais alto.\r\n\r\n\r\nEstes conceitos aplicados exigem mudança cultural e técnico para equipes de desenvolvimento, infraestrutura e segurança para funcionar mas permitem cada vez a diminuição do Lead Time, antecipação de potenciais vulnerabilidades e principalmente: testes mais completos de toda stack de uma aplicação.","mechanics":"","status":"Aguardando confirmação","author_agreement":null,"image_agreement":null,"created_at":"2019-05-05T23:26:24-03:00"}]